{
  "processing_date": "2025-09-24T22:19:22.721526",
  "original_extraction_date": "2025-09-24T19:22:53.841216",
  "total_courses": 142,
  "successful_extractions": 129,
  "success_rate": "90.8%",
  "processing_stats": {
    "learning_type_extracted": 129,
    "duration_extracted": 129,
    "outline_cleaned": 129
  },
  "courses": [
    {
      "title": "Genesys Cloud: Edge - Troubleshooting",
      "url": "https://beyond.genesys.com/explore/course/genesys-cloud-edge-troubleshooting",
      "description": "Genesys Cloud Edge is a telephony server that handles media processing, SIP, and telephony services by combining a powerful media server, SIP registrar, and SIP proxy into a single survivable appliance. There are times when troubleshooting is required to maintain the functionality of the Edge device(s) that service Genesys Cloud. Genesys Cloud: Edge – Troubleshooting eLearning explores the following concepts: Gathering and filtering logs, troubleshooting tools, SIP analysis, and common troubleshooting scenarios.",
      "learning_type": "Elearning",
      "duration": "85 mins",
      "course_outline": [
        "Getting and Filtering Logs",
        "Troubleshooting Tools",
        "SIP Analysis",
        "Common Issues"
      ],
      "page_length": 242028,
      "extraction_timestamp": "2025-09-24T18:37:37.620431"
    },
    {
      "title": "Genesys Cloud: Edge - BYOC Premises and Edge Introductory Concepts",
      "url": "https://beyond.genesys.com/explore/course/genesys-cloud-edge-byoc-premises-and-edge-introductory-concepts",
      "description": "Genesys Cloud: Edge - BYOC Premises and Edge Introductory Concepts eLearning provides an introductory overview into the three telephony deployments offered in Genesys Cloud. The following learning will explore: Telephony options - Genesys Cloud Voice, Bring Your Own Carrier (BYOC) Cloud, Bring Your Own Carrier (BYOC) Premises, Edge model availability and considerations, and PSTN resource needs.",
      "learning_type": "Elearning",
      "duration": "15 mins",
      "course_outline": [
        "Telephony Options",
        "Edge Models and Considerations",
        "PSTN Connectivity"
      ],
      "page_length": 241933,
      "extraction_timestamp": "2025-09-24T18:37:56.196311"
    },
    {
      "title": "Genesys Cloud: API - Workforce Management",
      "url": "https://beyond.genesys.com/explore/course/genesys-cloud-api-workforce-management",
      "description": "This course introduces you to Genesys Cloud Workforce Management (WFM) features through APIs. You will learn more about the basics of WFM. In addition, you will also explore how to fetch forecasting data and agent schedules using APIs.",
      "learning_type": "Elearning",
      "duration": "30 mins",
      "course_outline": [
        "Describe the basics of WFM.",
        "Use APIs to fetch forecast data.",
        "Demonstrate scheduling using APIs.",
        "Review the real-time and historical adherence data using WFM.",
        "Introduction to API and Workforce Management",
        "Workforce Management Reports"
      ],
      "page_length": 241219,
      "extraction_timestamp": "2025-09-24T18:38:12.373584"
    },
    {
      "title": "Genesys Cloud: API - Real-Time Reporting",
      "url": "https://beyond.genesys.com/explore/course/genesys-cloud-api-real-time-reporting",
      "description": "Genesys Cloud: API – Real-Time Reporting eLearning provides an overview of analytic APIs used in Genesys Cloud. This course describes which APIs are available to build real-time reports, how to interact with instantaneous API endpoints, and how to use notification APIs with client applications.",
      "learning_type": "Elearning",
      "duration": "15 mins",
      "course_outline": [
        "Overview",
        "Instantaneous Observation APIs",
        "Notification APIs"
      ],
      "page_length": 241462,
      "extraction_timestamp": "2025-09-24T18:38:28.492059"
    },
    {
      "title": "Genesys Cloud: API - Quality Report Generation",
      "url": "https://beyond.genesys.com/explore/course/genesys-cloud-api-quality-report-generation",
      "description": "Genesys Cloud: API- Quality Report Generation eLearning provides an overview of the quality management endpoints in Genesys Cloud. Quality management endpoint helps to evaluate agents and interactions to improve the overall quality of the contact center experience. The following eLearning provides insight about Evaluation and Survey APIs with examples. It also introduces you to the usage of filters to aid in querying the survey or evaluation data.",
      "learning_type": "Elearning",
      "duration": "25 mins",
      "course_outline": [
        "Overview",
        "Evaluation APIs",
        "Survey APIs",
        "Filters"
      ],
      "page_length": 241698,
      "extraction_timestamp": "2025-09-24T18:38:44.833887"
    },
    {
      "title": "Genesys Cloud: API - Historical Report Generation",
      "url": "https://beyond.genesys.com/explore/course/genesys-cloud-api-historical-report-generation",
      "description": "Genesys Cloud: API - Historical Report Generation eLearning provides an overview to the concepts related to the variety of analytic APIs available to use with Genesys Cloud. The eLearning course guides users through the analytics overview, while also exploring how to use the aggregated APIs and detail record APIs to extract data from the environment.",
      "learning_type": "Elearning",
      "duration": "30 mins",
      "course_outline": [
        "Analytics Overview",
        "Aggregated API",
        "Detail Record API",
        "Detail Record Jobs API"
      ],
      "page_length": 241455,
      "extraction_timestamp": "2025-09-24T18:39:00.755619"
    },
    {
      "title": "Genesys Cloud: WEM - Speech and Text Analytics - Voice and Digital Transcriptions",
      "url": "https://beyond.genesys.com/explore/course/genesys-cloud-wem-speech-and-text-analytics-voice-and-digital-transcriptions",
      "description": "Genesys Cloud: WEM - Speech and Text Analytics – Voice and Digital Transcriptions eLearning course explains implementation of voice and digital transcriptions and its usage in detail. Transcription is a critical feature of Speech and Text Analytics. The voice and digital interactions are automatically transcribed for non-linguistic analysis to create meaning from otherwise unstructured data.",
      "learning_type": "Elearning",
      "duration": "20 mins",
      "course_outline": [
        "Understand Interactions view and Content Search view.",
        "Explain the features of voice and digital transcripts.",
        "Explain the steps to configure voice and digital transcripts in your organization.",
        "Understand how to use transcripts.",
        "Product Overview Interactions List Key Features of Voice and Digital Transcripts Voice and Digital Configuration Prerequisites for Configuration Usage - Transcription Transcript Tab Audio Hook Monitor",
        "Interactions List",
        "Key Features of Voice and Digital Transcripts",
        "Prerequisites for Configuration"
      ],
      "page_length": 243981,
      "extraction_timestamp": "2025-09-24T18:39:16.792976"
    },
    {
      "title": "Genesys Cloud: API - Conversation Details",
      "url": "https://beyond.genesys.com/explore/course/genesys-cloud-api-conversation-details",
      "description": "Genesys Cloud: API - Conversation Details eLearning provides an overview of the term conversation in Genesys Cloud by exploring the conversation structure to properly analyze the JSON responses received from Genesys Cloud.",
      "learning_type": "Elearning",
      "duration": "10 mins",
      "course_outline": [
        "The following section is covered in this eLearning course: Introduction to Conversation details",
        "Introduction to Conversation details"
      ],
      "page_length": 241105,
      "extraction_timestamp": "2025-09-24T18:39:32.738741"
    },
    {
      "title": "Genesys Cloud: API - Authorization",
      "url": "https://beyond.genesys.com/explore/course/genesys-cloud-api-authorization",
      "description": "Genesys Cloud: API - Authorization eLearning provides an overview of what authorization means when communicating with the Genesys Cloud Platform APIs. The course walks users through the OAuth 2 framework used by Genesys Cloud and describes how different methods of authorization are used to grant applications permission to communicate with Genesys Cloud.",
      "learning_type": "Elearning",
      "duration": "25 mins",
      "course_outline": [
        "Authorization Overview",
        "Implicit Grant",
        "Authorization Code Grant",
        "Client Credentials Grant",
        "SAML2 Bearer Grant"
      ],
      "page_length": 241476,
      "extraction_timestamp": "2025-09-24T18:39:49.017550"
    },
    {
      "title": "Genesys Cloud: Social Listening - Setup and Configuration",
      "url": "https://beyond.genesys.com/explore/course/genesys-cloud-social-listening-setup-and-configuration",
      "description": "This course introduces the foundational concepts of the Genesys Cloud Social feature. You will learn how to integrate Genesys Cloud with social media platforms and interpret social posts based on the listening rules you configure.",
      "learning_type": "Elearning",
      "duration": "30 mins",
      "course_outline": [
        "Explain the purpose and value of social listening for customer engagement in Genesys Cloud.",
        "Identify the supported social platform integrations.",
        "Configure Genesys Cloud Social, including topics, data ingestion, and escalation rules.",
        "Demonstrate how to set up data ingestion rules for capturing relevant social posts.",
        "Recognize available views in the interface.",
        "Navigate the Social Listening Posts view and escalate social content manually.",
        "Review the Social Data Usage view to check your organization’s monthly social data usage."
      ],
      "page_length": 241951,
      "extraction_timestamp": "2025-09-24T18:40:04.913685"
    },
    {
      "title": "Genesys Cloud: Gamification Concepts",
      "url": "https://beyond.genesys.com/explore/course/genesys-cloud-gamification-concepts",
      "description": "",
      "learning_type": "",
      "duration": "",
      "course_outline": [],
      "page_length": 190063,
      "extraction_timestamp": "2025-09-24T18:40:20.717236"
    },
    {
      "title": "Genesys Cloud: AI/Bots: Virtual Agent - Setup and Configuration",
      "url": "https://beyond.genesys.com/explore/course/genesys-cloud-ai-bots-virtual-agent-setup-and-configuration",
      "description": "",
      "learning_type": "",
      "duration": "",
      "course_outline": [],
      "page_length": 190063,
      "extraction_timestamp": "2025-09-24T18:40:36.143067"
    },
    {
      "title": "Genesys Cloud: WEM - Supervisor AI for Quality Management",
      "url": "https://beyond.genesys.com/explore/course/genesys-cloud-wem-supervisor-ai-for-quality-management",
      "description": "This course introduces AI Scoring in Genesys Cloud, a feature that automates interaction evaluations. In addition, it covers how to configure AI Scoring and provides insights about framing evaluation questions to get better results.",
      "learning_type": "Elearning",
      "duration": "5 mins",
      "course_outline": [
        "Genesys Cloud: Quality Management Basics",
        "Genesys Cloud: Quality Management - Evaluating Interactions",
        "Understand the purpose and functioning of AI Scoring.",
        "Configure AI Scoring to automate evaluations."
      ],
      "page_length": 240882,
      "extraction_timestamp": "2025-09-24T18:40:52.646685"
    },
    {
      "title": "Genesys Cloud: WEM - Supervisor AI for Speech and Text Analytics",
      "url": "https://beyond.genesys.com/explore/course/genesys-cloud-wem-supervisor-ai-for-speech-and-text-analytics",
      "description": "This course introduces Supervisor AI and the different Copilot features for Speech and Text Analytics. In addition, it also provides a high-level overview of the different features and how they augment the supervisory role.",
      "learning_type": "Elearning",
      "duration": "5 mins",
      "course_outline": [
        "Genesys Cloud: WEM - Speech and Text Analytics - Getting Started",
        "Genesys Cloud: WEM - Speech and Text Analytics - Voice and Digital Transcriptions",
        "Explain the role of Supervisor AI in contact center environments.",
        "Identify and explain the core Copilot features of Supervisor AI.",
        "Explain the benefits of the different Copilot features."
      ],
      "page_length": 241018,
      "extraction_timestamp": "2025-09-24T18:41:08.515357"
    },
    {
      "title": "Genesys Cloud: Introduction to CX as Code",
      "url": "https://beyond.genesys.com/explore/course/genesys-cloud-introduction-to-cx-as-code",
      "description": "This course introduces you to CX as Code and provides the foundational knowledge of Infrastructure as Code. You will also learn the basics of Terraform and Terraform providers, common terminologies used, and the most frequently used commands. In addition, this course acquaints you with the best practices to follow.",
      "learning_type": "Elearning",
      "duration": "40 mins",
      "course_outline": [
        "Describe the purpose of CX as Code in the Genesys Cloud development ecosystem.",
        "List the benefits of using CX as Code.",
        "Explain the purpose of Terraform commands and terminologies used.",
        "Install and set up Terraform for your Genesys Cloud organization.",
        "Use the Genesys Cloud provider to perform basic operations.",
        "Utilize the recommended best practices for CX as Code.",
        "Introduction to CX as Code"
      ],
      "page_length": 242060,
      "extraction_timestamp": "2025-09-24T18:41:24.449154"
    },
    {
      "title": "Genesys Cloud: Journey Management - Understanding Data Behind the Insights",
      "url": "https://beyond.genesys.com/explore/course/genesys-cloud-journey-management-understanding-data-behind-the-insights",
      "description": "This course helps you understand the event data and data processes that power Genesys Cloud Journey Management. You will build your data literacy as you learn about how Journey Management counts customers and interactions to fully understand the scope of customer behavior across Genesys Cloud channels. In addition, this course discusses how to influence data quality across your organization to get the most out of Journey Management.",
      "learning_type": "Elearning",
      "duration": "20 mins",
      "course_outline": [
        "Describe the role of Genesys Cloud Journey Management in analyzing, monitoring, and orchestrating customer journeys to enhance experiences and improve business outcomes.",
        "Explain how events and event attributes are captured in Genesys Cloud and how they are used to measure customer journeys.",
        "Differentiate between event count and customer count and assess how identity resolution, contact merging, and external contacts work together to produce high-quality journey data.",
        "Evaluate your role in data quality and influence key stakeholders to take action using External Contacts.",
        "Why Should You Understand Journey Management Data?Journey Management Versus Single Customer ViewEvent MetadataEvent Count Versus Customer CountHow is Journey Management Data Processed?Improving Your Organization’s Data",
        "Why Should You Understand Journey Management Data?",
        "Journey Management Versus Single Customer View",
        "Event Metadata"
      ],
      "page_length": 242597,
      "extraction_timestamp": "2025-09-24T18:41:40.272800"
    },
    {
      "title": "Genesys Cloud: AI Solutions for Customer Engagement",
      "url": "https://beyond.genesys.com/explore/course/genesys-cloud-ai-solutions-for-customer-engagement",
      "description": "This course provides an in-depth overview of the various Artificial Intelligence (AI) features of Genesys Cloud associated with customer engagement. You will learn the functionalities and benefits of AI-based customer engagement features such as Genesys Predictive Engagement, Genesys Predictive Routing, and Agent Copilot and how these features work together.",
      "learning_type": "Elearning",
      "duration": "15 mins",
      "course_outline": [
        "Describe Genesys Cloud AI and its various AI-powered customer engagement solutions.",
        "Explain how Genesys Predictive Engagement personalizes customer engagements.",
        "Explain Genesys Predictive Routing and its ability to route interactions to suitable agents.",
        "Explain Genesys Agent Copilot and its capability to provide agents with the next-best action recommendations on customer intent.",
        "Understand how AI-powered customer engagement solutions work together to enhance customer experiences.",
        "Introduction to Genesys Cloud AI for Customer Engagement",
        "Genesys Predictive Engagement"
      ],
      "page_length": 242066,
      "extraction_timestamp": "2025-09-24T18:41:56.264449"
    },
    {
      "title": "Genesys Cloud: AI Solutions for Customer Self-Service",
      "url": "https://beyond.genesys.com/explore/course/genesys-cloud-ai-solutions-for-customer-self-service",
      "description": "This course covers the Artificial Intelligence (AI)-powered tools and technologies in self-service solutions, including bot and virtual agent features, that help customers interact with your organization across various channels. You will also learn about the benefits of these AI features and how their adoption will help you grow your business.",
      "learning_type": "Elearning",
      "duration": "20 mins",
      "course_outline": [
        "Identify the AI features Genesys offers for customer self-service interactions and their impact on your business.",
        "Describe how Genesys knowledge services AI helps customers resolve their queries with self-service solutions.",
        "Explain how AI-dialog engine bot flows help enhance customer self-service through calls, chats, and message flows.",
        "Describe how digital bot flows enhance the customer self-service experience through message flows.",
        "Explain how Virtual Agent enhances both your voice and digital bot flows with conversational and generative AI capabilities.",
        "Genesys Knowledge Services",
        "Genesys Dialog Engine Bot Flows"
      ],
      "page_length": 242668,
      "extraction_timestamp": "2025-09-24T18:42:12.278009"
    },
    {
      "title": "Genesys Cloud CX: WEM - Speech and Text Analytics - Sentiment Analysis",
      "url": "https://beyond.genesys.com/explore/course/genesys-cloud-cx-wem-speech-and-text-analytics-sentiment-analysis",
      "description": "Genesys Cloud CX– Sentiment Analysis eLearning course covers concepts to understand customer’s attitudes (positive, negative, or neutral) to gain better insights into customer experience, which helps improve service delivery and agent performance.",
      "learning_type": "Elearning",
      "duration": "20 mins",
      "course_outline": [
        "Assists in understanding the benefits, basic concepts, and critical features of voice and digital interactions.",
        "Helps to understand the customer’s sentiment by working with the features and analyzing statistics.",
        "Provides steps on how to enable text analytics for digital interactions.",
        "Understanding Sentiment Analysis",
        "Key Features",
        "Prerequisites",
        "Working with Sentiment Analysis"
      ],
      "page_length": 244066,
      "extraction_timestamp": "2025-09-24T18:42:28.278483"
    },
    {
      "title": "Genesys Cloud: API - Introduction to the Platform API",
      "url": "https://beyond.genesys.com/explore/course/genesys-cloud-api-introduction-to-the-platform-api",
      "description": "Genesys Cloud: API - Introduction to the Platform API eLearning provides an overview to the basic set of resources and processes related to Genesys Cloud API endpoints. The eLearning course walks users through an introduction of what APIs are, exploring how APIs help control various aspects of the Genesys Cloud environment. Examples include access to the system configuration, management of conversations, and many more evolving possibilities.",
      "learning_type": "Elearning",
      "duration": "15 mins",
      "course_outline": [
        "Introduction",
        "APIs in Genesys Cloud",
        "Authorization",
        "Regions in Genesys Cloud"
      ],
      "page_length": 241667,
      "extraction_timestamp": "2025-09-24T18:42:44.408822"
    },
    {
      "title": "Genesys Cloud: Contact Center Administrator - Data and Analytics",
      "url": "https://beyond.genesys.com/explore/course/genesys-cloud-contact-center-administrator-data-and-analytics",
      "description": "Genesys Cloud: Contact Center Administrator- Data and Analytics eLearning provides an overview into the basics of data and analytics in Genesys Cloud Contact Center. The following eLearning module demonstrates how monitoring performance for interactions, agents, and queues can drive improvement within your call center. Topics in this eLearning include: Overview of performance dashboards, accessing current and historical data references for queue, agent and interaction views, and how to use reports in Genesys Cloud.",
      "learning_type": "Elearning",
      "duration": "15 mins",
      "course_outline": [
        "Introduction to performance dashboards, quality evaluations, and the agent performance view",
        "Queue Views",
        "Agents View",
        "Interaction View",
        "Reports Overview"
      ],
      "page_length": 242047,
      "extraction_timestamp": "2025-09-24T18:43:00.232788"
    },
    {
      "title": "Genesys Cloud CX: Coaching - Usage for Supervisors",
      "url": "https://beyond.genesys.com/explore/course/genesys-cloud-cx-coaching-usage-for-supervisors",
      "description": "The Genesys Cloud CX: Coaching – Usage for Supervisors course explains the importance of coaching and the steps to schedule coaching appointments with agents. You will learn how to edit an existing appointment, add notes, and change the status of an appointment. In addition, you will learn how to add an interaction to an existing coaching appointment.",
      "learning_type": "Elearning",
      "duration": "10 mins",
      "course_outline": [
        "Schedule coaching appointments with your agents.",
        "View and edit existing coaching appointments.",
        "Add notes to coaching appointments.",
        "Change the statuses of coaching appointments.",
        "Add interactions to existing coaching appointments.",
        "The following modules are covered in this eLearning course:Scheduling a Coaching AppointmentViewing and Editing a Coaching AppointmentAdding Notes to Coaching AppointmentsViewing Coaching Appointment StatusAdding an Interaction to an Existing Coaching Appointment",
        "Scheduling a Coaching Appointment",
        "Viewing and Editing a Coaching Appointment"
      ],
      "page_length": 242756,
      "extraction_timestamp": "2025-09-24T18:43:16.253055"
    },
    {
      "title": "Genesys Cloud: Coaching - Usage for Agents",
      "url": "https://beyond.genesys.com/explore/course/genesys-cloud-coaching-usage-for-agents",
      "description": "The Genesys Cloud CX: Coaching – Usage for Agents course helps you work with coaching appointments. You will learn to view details of your coaching appointments and add notes to them.",
      "learning_type": "Elearning",
      "duration": "5 mins",
      "course_outline": [
        "View a Coaching Appointment",
        "Add notes to Coaching Appointments",
        "Viewing a Coaching Appointment",
        "Adding Notes to Coaching Appointments"
      ],
      "page_length": 242109,
      "extraction_timestamp": "2025-09-24T18:43:32.242724"
    },
    {
      "title": "Genesys Cloud: Coaching - Overview",
      "url": "https://beyond.genesys.com/explore/course/genesys-cloud-coaching-overview",
      "description": "The Genesys Cloud: Coaching – Overview course provides a brief introduction to coaching. You will learn the importance of coaching in your contact center. You also will learn the basic features of coaching in Genesys Cloud.",
      "learning_type": "Elearning",
      "duration": "5 mins",
      "course_outline": [
        "Explain the importance of coaching.",
        "Describe the basic concepts of Genesys Cloud CX Coaching.",
        "The following modules are covered in this eLearning course: Importance of CoachingBasic Concept of Genesys Cloud CX Coaching",
        "Importance of Coaching",
        "Basic Concept of Genesys Cloud CX Coaching"
      ],
      "page_length": 242066,
      "extraction_timestamp": "2025-09-24T18:43:48.157280"
    },
    {
      "title": "Genesys Cloud - QM Web Survey",
      "url": "https://beyond.genesys.com/explore/course/genesys-cloud-qm-web-survey",
      "description": "As a supervisor or contact center manager, focusing on customer satisfaction after a service interaction or business transaction is key. The Genesys Cloud QM Web Survey eLearning course covers concepts to create and use web surveys to gain vital information about the effectiveness of your service and customers’ experience during an interaction.",
      "learning_type": "Elearning",
      "duration": "35 mins",
      "course_outline": [
        "The following modules are covered in this eLearning course: · Genesys Cloud QM Web Survey Overview · Genesys Cloud QM Web Survey Usage"
      ],
      "page_length": 242514,
      "extraction_timestamp": "2025-09-24T18:44:04.298061"
    },
    {
      "title": "Genesys Cloud: Agentless Voice Notifications",
      "url": "https://beyond.genesys.com/explore/course/genesys-cloud-agentless-voice-notifications",
      "description": "This course covers usage of the Agentless Dialing Mode in Genesys Cloud. There are many things that customers call into call centers for, and not all of them need a live agent on the other line. Agentless dialing can be a very flexible system that will increase the efficiency of your call center. The course also covers how to collect troubleshooting logs for Customer Care and case study references.",
      "learning_type": "Elearning",
      "duration": "10 mins",
      "course_outline": [
        "Agentless voice overview",
        "How-to for collection of logs",
        "Case studies",
        "Additional links and article references"
      ],
      "page_length": 241627,
      "extraction_timestamp": "2025-09-24T18:44:20.210040"
    },
    {
      "title": "Genesys Cloud Integrations: Data Actions",
      "url": "https://beyond.genesys.com/explore/course/genesys-cloud-integrations-data-actions",
      "description": "Data action integrations available in Genesys Cloud provides the ability to connect and access data from different systems. The following eLearning explores the key concepts of data actions integration and lists the various data action integration offerings in Genesys Cloud. The eLearning sequence will walk administrators through the setup of the Genesys Cloud™ data actions integration for usage with Genesys Architect, managing data actions, and lastly, troubleshooting suggestions.",
      "learning_type": "Elearning",
      "duration": "25 mins",
      "course_outline": [
        "Introduction of Data Actions",
        "Data Actions Integration Setup",
        "Troubleshooting",
        "Course Review and Resources"
      ],
      "page_length": 241836,
      "extraction_timestamp": "2025-09-24T18:44:36.117885"
    },
    {
      "title": "Genesys Cloud: Contact Center Administrator - Data Actions",
      "url": "https://beyond.genesys.com/explore/course/genesys-cloud-contact-center-administrator-data-actions",
      "description": "Genesys Cloud: Contact Center Administrator - Data Actions eLearning provides an overview of data action integrations and explains how it allows users to access the Genesys Cloud Platform API. In addition, the course explores the use of data actions to make routing decision enhancements within Genesys Cloud Architect. Furthermore, the course demonstrates how data actions are used to present information within scripts.",
      "learning_type": "Elearning",
      "duration": "5 mins",
      "course_outline": [
        "Data Actions"
      ],
      "page_length": 241523,
      "extraction_timestamp": "2025-09-24T18:44:52.030207"
    },
    {
      "title": "Genesys Cloud: Contact Center Administrator - Outbound Dialing",
      "url": "https://beyond.genesys.com/explore/course/genesys-cloud-contact-center-administrator-outbound-dialing",
      "description": "Genesys Cloud: Contact Center Administrator – Outbound Dialing eLearning provides an overview into the basics of outbound dialing campaigns in Genesys Cloud Contact Center. The following eLearning module will walk through setting up a campaign and taking a closer look into the advanced features of campaigns. Topics in this eLearning include dialing modes, call analysis response, contact lists, DNC lists, call rule sets, callable time sets, campaign rules/sequencing/schedules/dashboard, and wrap up code mapping.",
      "learning_type": "Elearning",
      "duration": "15 mins",
      "course_outline": [
        "Setting up a campaign",
        "Advanced Campaign Features"
      ],
      "page_length": 241850,
      "extraction_timestamp": "2025-09-24T18:45:08.020092"
    },
    {
      "title": "Genesys Cloud Integrations: Embedded Clients",
      "url": "https://beyond.genesys.com/explore/course/genesys-cloud-integrations-embedded-clients",
      "description": "Genesys Cloud embedded clients are instances of the Genesys Cloud’s contact center service running inside third-party systems or as browser extensions. Genesys Cloud Embeddable Framework allows for custom development of Genesys Cloud contact services for integration within a customer’s own systems and tools. The following eLearning will explore embedded clients as browser extensions for Google Chrome and Firefox, third-party integrations within Salesforce and Zendesk, and Genesys Embedded Framework concepts.",
      "learning_type": "Elearning",
      "duration": "40 mins",
      "course_outline": [
        "Browser Extensions",
        "Third-Party Systems",
        "Embeddable Framework",
        "Module Review",
        "Troubleshooting/Tips",
        "Additional Links and Articles"
      ],
      "page_length": 241950,
      "extraction_timestamp": "2025-09-24T18:45:24.015063"
    },
    {
      "title": "Genesys Cloud Integrations: Custom Client Applications",
      "url": "https://beyond.genesys.com/explore/course/genesys-cloud-integrations-custom-client-applications",
      "description": "Genesys Cloud offers the ability for custom client applications to be installed. Custom client applications are third-party applications that are not available in AppFoundry. The following eLearning will navigate users through the following learning objectives: custom applications as standalone applications, custom applications as widgets, and maintenance of installed custom client applications.",
      "learning_type": "Elearning",
      "duration": "10 mins",
      "course_outline": [
        "Custom Client Application Overview",
        "Custom Application as a Standalone Application",
        "Custom Application as a Widget",
        "Custom Client Application Maintenance",
        "Module Review",
        "Additional Links and Articles"
      ],
      "page_length": 241825,
      "extraction_timestamp": "2025-09-24T18:45:39.977202"
    },
    {
      "title": "Genesys Cloud Integrations: AppFoundry",
      "url": "https://beyond.genesys.com/explore/course/genesys-cloud-integrations-appfoundry",
      "description": "This course offers insights into Genesys Cloud AppFoundry. You will learn how to access AppFoundry and the different types of applications available there. In addition, you will learn about the different categories of applications, integrations, and solutions in AppFoundry aimed at improving customer experience.",
      "learning_type": "Elearning",
      "duration": "20 mins",
      "course_outline": [
        "Understand the role of AppFoundry within the Genesys Cloud ecosystem.",
        "Access and navigate Genesys Cloud AppFoundry.",
        "Identify the different types of AppFoundry applications.",
        "List out the best practices to follow while using AppFoundry.",
        "Introduction to AppFoundry",
        "Accessing AppFoundry",
        "Types of Applications in AppFoundry"
      ],
      "page_length": 241736,
      "extraction_timestamp": "2025-09-24T18:45:55.815570"
    },
    {
      "title": "Genesys Cloud Integrations: Integration Features",
      "url": "https://beyond.genesys.com/explore/course/genesys-cloud-integrations-integration-features",
      "description": "Genesys Cloud enables your contact center to seamlessly integrate with existing systems. Many businesses use multiple tools and systems to serve a wide variety of business functions. Integrations within Genesys Cloud help your business synchronize and access up-to-date data, bring external data systems into Genesys Cloud, access public APIs for customized solutions, and access a wide range of click-to-install integrations in Genesys AppFoundry. This eLearning course introduces the following concepts related to Genesys Cloud Integration features AppFoundry, OAuth, Bots, Collaboration, Custom Client Applications, Data Actions, Embedded Clients, External Contacts, Identify Management, Single Sign-On, Text-to-Speech, Quality Management, and Webhooks (Chat Integrations).",
      "learning_type": "Elearning",
      "duration": "65 mins",
      "course_outline": [
        "Introduction",
        "Integration Features",
        "AppFoundry",
        "Collaboration",
        "Custom Client Applications"
      ],
      "page_length": 242844,
      "extraction_timestamp": "2025-09-24T18:46:11.671580"
    },
    {
      "title": "Genesys Cloud CX: WEM - Adding your Schedule to External Calendars",
      "url": "https://beyond.genesys.com/explore/course/genesys-cloud-cx-wem-adding-your-schedule-to-external-calendars",
      "description": "Genesys Cloud CX: WEM - Adding your schedule to External Calendars covers information on how agents can add their schedules to an external calendar using Genesys Cloud Workforce Management.",
      "learning_type": "Elearning",
      "duration": "10 mins",
      "course_outline": [
        "Explain how agents can add their schedules to an external calendar.",
        "Explain how agents can synchronize their workforce management schedule to an external calendar.",
        "Generate Calendar Link",
        "Add Schedule to External Calendars"
      ],
      "page_length": 242399,
      "extraction_timestamp": "2025-09-24T18:46:27.548358"
    },
    {
      "title": "Genesys Cloud: WEM - Shift Trades for Agents",
      "url": "https://beyond.genesys.com/explore/course/genesys-cloud-wem-shift-trades-for-agents",
      "description": "This course introduces you to the basic concepts of managing shift trades using the My Trades panel in Genesys Cloud. You will also learn how to post a trade request for any available agent, request a shift trade with a specific colleague, or initiate a shift trade with the system—giving you the flexibility to manage your schedule even when other agents are unavailable. In addition, this course equips you with the knowledge to accept incoming trade requests, drop a shift, pick up extra shifts, and stay on top of shift trade activity through system notifications.",
      "learning_type": "Elearning",
      "duration": "20 mins",
      "course_outline": [
        "Navigate the shift trades (My Trades) panel.",
        "Post a shift trade request for any available agent to swap shifts.",
        "Request shift trade with a specific agent.",
        "Initiate a shift trade with the system.",
        "Accept a shift trade request.",
        "Drop a shift.",
        "Pick up an extra shift.",
        "View shift trade notifications."
      ],
      "page_length": 242312,
      "extraction_timestamp": "2025-09-24T18:46:43.248300"
    },
    {
      "title": "Genesys Cloud CX: WEM - Schedules for Agents",
      "url": "https://beyond.genesys.com/explore/course/genesys-cloud-cx-wem-schedules-for-agents",
      "description": "Genesys Cloud CX: WEM – Schedules for Agents course covers concepts to provide an agent information on how to navigate to their schedules and change date filters using Genesys Cloud Workforce Management.",
      "learning_type": "Elearning",
      "duration": "5 mins",
      "course_outline": [
        "Describe how agents can access their schedules from My Performance Views.",
        "Show agents an example of their schedules.",
        "Describe how agents can see the most up-to-date schedule information by clicking on Refresh icon on the top right of the schedule view.",
        "Demonstrate how to use the date filter to customize analytics views.",
        "Demonstrate how to use presets to filter metrics by date and custom date range to filter metrics.",
        "Describe how agents can see out of adherence notification.",
        "Work with my Schedule"
      ],
      "page_length": 242710,
      "extraction_timestamp": "2025-09-24T18:47:01.057045"
    },
    {
      "title": "Genesys Cloud: Web Messaging",
      "url": "https://beyond.genesys.com/explore/course/genesys-cloud-web-messaging",
      "description": "Genesys Cloud: Web Messaging eLearning provides an overview into what features come with this digital channel offer for Genesys Cloud users. Web Messaging offers the opportunity to track the entire customer journey to aid in delivering a better customer experience through persistent, asynchronous conversations. The following eLearning walks users through an introduction into Web Messaging, the Messenger configuration, and lastly the Messenger Deployment process.",
      "learning_type": "Elearning",
      "duration": "20 mins",
      "course_outline": [
        "Introduction to Web Messaging",
        "Messenger Configuration",
        "Messenger Deployment"
      ],
      "page_length": 242039,
      "extraction_timestamp": "2025-09-24T18:47:17.043390"
    },
    {
      "title": "Genesys Cloud: Voice Additional Features for Agents",
      "url": "https://beyond.genesys.com/explore/course/genesys-cloud-voice-additional-features-for-agents",
      "description": "The Genesys Cloud Voice Additional Features course introduces you to advanced call-handling features in Genesys Cloud. You will learn how to use secure pause and how secure flow transfer works in Genesys Cloud. In addition, this course explains the difference between blind and consult transfers, as well as how conference calls work in Genesys Cloud. You'll also learn how to handle group calls, view call history, and forward calls.",
      "learning_type": "Elearning",
      "duration": "15 mins",
      "course_outline": [
        "Use secure pause during a call.",
        "Transfer calls to secure flow.",
        "Perform blind and consult transfers.",
        "Make conference calls.",
        "Use additional features such as call forwarding, call history, and group calls.",
        "Using Secure Pause",
        "Transferring Calls to Secure Flow"
      ],
      "page_length": 241835,
      "extraction_timestamp": "2025-09-24T18:47:32.964472"
    },
    {
      "title": "Genesys Cloud CX: Email for Agents",
      "url": "https://beyond.genesys.com/explore/course/genesys-cloud-cx-email-for-agents",
      "description": "This course introduces you to Genesys Cloud CX email interactions. You will learn how to accept email interactions, respond to emails, transfer or disconnect emails, and view email interaction history within Genesys Cloud CX.",
      "learning_type": "Elearning",
      "duration": "20 mins",
      "course_outline": [
        "Accept an ACD email message",
        "View and link a contact’s profile",
        "View email interaction history",
        "Reply to an email message",
        "Blind transfer or disconnect an email message",
        "Accept an ACD Email Message",
        "View and Link a Contact’s Profile"
      ],
      "page_length": 241340,
      "extraction_timestamp": "2025-09-24T18:47:48.879288"
    },
    {
      "title": "Genesys Cloud: Cloud Media Services - Telephony Connection Options",
      "url": "https://beyond.genesys.com/explore/course/genesys-cloud-cloud-media-services-telephony-connection-options",
      "description": "Genesys Cloud: Cloud Media Services – Telephony Connection Options eLearning provides an overview of the different telephony solutions available for Genesys Cloud. Learners will explore the essential features of Genesys Cloud Voice, Bring Your Own Carrier (BYOC) Cloud, and lastly, BYOC Premise. Upon completion of this course, users will have a better understanding of how to use the telephony options separately or in combination to cater to the telecommunication needs of the customer.",
      "learning_type": "Elearning",
      "duration": "20 mins",
      "course_outline": [
        "Telephony Options",
        "Telephony Options Detailed"
      ],
      "page_length": 241942,
      "extraction_timestamp": "2025-09-24T18:48:04.542648"
    },
    {
      "title": "Genesys Cloud CX: Campaign Tasks for Agents",
      "url": "https://beyond.genesys.com/explore/course/genesys-cloud-cx-campaign-tasks-for-agents",
      "description": "An outbound campaign enables your company to contact potential customers and achieve your business goals. This course introduces you to the basic concepts of an outbound campaign and its functionalities, such as dialing modes and callback features, from an agent's point of view. You will also learn how to handle outbound calls and perform various tasks based on your privileges. In addition, this course equips you with the knowledge to handle Do Not Contact (DNC) customers.",
      "learning_type": "Elearning",
      "duration": "20 mins",
      "course_outline": [
        "Explain the basics of outbound campaigns, including the use of agent scripts.",
        "Differentiate between the various dialing modes used in outbound campaigns.",
        "Determine how to schedule and handle callbacks in Genesys Cloud.",
        "Discuss the steps to add customers to the DNC list.",
        "Getting Started with Genesys Outbound Campaign",
        "Outbound Campaign Dialing Modes",
        "Outbound Campaign Features"
      ],
      "page_length": 241884,
      "extraction_timestamp": "2025-09-24T18:48:20.392197"
    },
    {
      "title": "Genesys Cloud: Edge - Networking",
      "url": "https://beyond.genesys.com/explore/course/genesys-cloud-edge-networking",
      "description": "Genesys Cloud: Edge – Networking eLearning provides an overview of network requirements that are critical for Genesys Cloud Edge devices to work correctly. As System Administrators, you will learn the following aspects regarding network considerations: Requirements and considerations for Edges, best practices for local Edge connectivity, firewall, DMZ, ports, bandwidth, latency, Jitter, Packet Loss, and lastly, QoS.",
      "learning_type": "Elearning",
      "duration": "25 mins",
      "course_outline": [
        "Requirements and Considerations",
        "Best Practices for Edge Local Connectivity",
        "Firewall, DMZ, and Ports",
        "Bandwidth, Latency, Jitter, Packet Loss, and QoS"
      ],
      "page_length": 241946,
      "extraction_timestamp": "2025-09-24T18:48:36.099544"
    },
    {
      "title": "Genesys Cloud: Edge - BYOC Premise Configuration",
      "url": "https://beyond.genesys.com/explore/course/genesys-cloud-edge-byoc-premise-configuration",
      "description": "BYOC Premise Configuration eLearning provides an overview of basic telephony objects involved in the configuration process of Genesys Cloud Edge devices. As System Administrators, you will learn the following aspects of the configuration process: Step-by-step configuration details of the Genesys Cloud Edge standard v3, creating and assigning DID and extension numbers, managing the default number plans and outbound routes, and lastly, the configuration overview of managed and unmanaged phones.",
      "learning_type": "Elearning",
      "duration": "45 mins",
      "course_outline": [
        "BYOC Premise Configuration Concepts",
        "BYOC Premise Configuration: Step by Step Process",
        "Call Management",
        "Phone Management"
      ],
      "page_length": 242080,
      "extraction_timestamp": "2025-09-24T18:48:52.003053"
    },
    {
      "title": "Genesys Cloud: Edge - How It Works",
      "url": "https://beyond.genesys.com/explore/course/genesys-cloud-edge-how-it-works",
      "description": "Genesys Cloud: Edge – How it Works eLearning provides an overview into telephony objects and how they work together to provide effective communication with the Genesys Cloud Edge devices. As System Administrators, you will learn the basic objects necessary for telephony configuration and their relationship to each other. External SIP Proxy usage is also explored if requirement is needed between the Edge and SIP provider.",
      "learning_type": "Elearning",
      "duration": "15 mins",
      "course_outline": [
        "Telephony Concepts",
        "When to use an External SIP Proxy"
      ],
      "page_length": 241699,
      "extraction_timestamp": "2025-09-24T18:49:08.703713"
    },
    {
      "title": "Genesys Cloud: Edge - WebRTC",
      "url": "https://beyond.genesys.com/explore/course/genesys-cloud-edge-webrtc",
      "description": "Genesys Cloud: Edge - WebRTC eLearning explores introductory concepts related to Genesys Cloud’s usage of the Web Real-Time Communication (WebRTC) protocol. Genesys Cloud WebRTC phones use WebRTC technology via web browser to replace the need for physical phones. The following objectives are covered in detail: Overview of How WebRTC works, WebRTC workflows within Genesys Cloud, Network Address Translation (NAT) options, and lastly setup of WebRTC in Genesys Cloud Voice, BYOC Cloud and Premises options.",
      "learning_type": "Elearning",
      "duration": "20 mins",
      "course_outline": [
        "How WebRTC Works",
        "WebRTC Workflow",
        "NAT Configuration Options",
        "WebRTC Setup"
      ],
      "page_length": 241901,
      "extraction_timestamp": "2025-09-24T18:49:24.513410"
    },
    {
      "title": "Introduction to Genesys Cloud for Supervisors: Essentials",
      "url": "https://beyond.genesys.com/explore/course/introduction-to-genesys-cloud-for-supervisors-essentials",
      "description": "This course introduces you to the essential settings and configurations for managing agents and queues and enabling your contact center to handle incoming interactions effectively.",
      "learning_type": "Elearning",
      "duration": "20 mins",
      "course_outline": [
        "Identify the essential settings and configurations in Genesys Cloud for handling incoming interactions effectively.",
        "Explain automatic call distribution (ACD).",
        "Create ACD skills and languages.",
        "Configure agent utilizations.",
        "Create and configure queues.",
        "Describe how interactions flow into queues.",
        "Create and assign canned responses to queues.",
        "Create and assign wrap-up codes to queues.",
        "Explain after-contact work (ACW) and its configuration options."
      ],
      "page_length": 241545,
      "extraction_timestamp": "2025-09-24T18:49:40.816565"
    },
    {
      "title": "Genesys Cloud Telephony",
      "url": "https://beyond.genesys.com/explore/course/genesys-cloud-telephony",
      "description": "Stand up your organization quickly by learning basic system set-up requirements for telephony.",
      "learning_type": "Elearning",
      "duration": "15 mins",
      "course_outline": [
        "Accessing Genesys Cloud",
        "Adding agents and assigning roles/permissions",
        "Queue configuration for ACW and wrap-up codes",
        "Evaluation and routing methods",
        "Agent utilization",
        "Telephony services and WebRTC",
        "Describe the Genesys Cloud CX platform and its components.",
        "Navigate through admin and agent user interface.",
        "Add agents to your contact center and manage their profiles, groups, roles and permissions."
      ],
      "page_length": 241986,
      "extraction_timestamp": "2025-09-24T18:49:57.250779"
    },
    {
      "title": "Genesys Cloud Routing",
      "url": "https://beyond.genesys.com/explore/course/genesys-cloud-routing",
      "description": "This course introduces you to the basic concepts of Automatic Call Distribution (ACD). You'll also learn how the inbound call and email flows work.",
      "learning_type": "Elearning",
      "duration": "5 mins",
      "course_outline": [
        "Explain the basic concepts associated with ACD configuration",
        "Work with inbound call flows and callbacks",
        "Work with inbound email flows",
        "Course Overview",
        "Basic ACD Concepts including Evaluation and Routing Methods",
        "Overview of Inbound Call Flow and Callback",
        "Overview of Inbound Email Flow"
      ],
      "page_length": 241076,
      "extraction_timestamp": "2025-09-24T18:50:14.146974"
    },
    {
      "title": "Genesys Cloud: Voice Essentials for Agents",
      "url": "https://beyond.genesys.com/explore/course/genesys-cloud-voice-essentials-for-agents",
      "description": "The Genesys Cloud: Voice Essentials for Agents course helps you understand the essential call-handling tasks in Genesys Cloud. You will learn basic call functions such as answering incoming calls, using scripts, and performing after-call work. Additionally, you will learn how to initiate calls and handle callbacks in Genesys Cloud.",
      "learning_type": "Elearning",
      "duration": "15 mins",
      "course_outline": [
        "Handle incoming calls using various call handling features.",
        "Initiate non-ACD and ACD calls.",
        "Handle callbacks.",
        "Answering Incoming Calls",
        "Understanding Mute and Hold Functions",
        "Performing After Call Work",
        "Making Calls"
      ],
      "page_length": 241423,
      "extraction_timestamp": "2025-09-24T18:50:29.980986"
    },
    {
      "title": "Genesys Cloud CX: An Overview",
      "url": "https://beyond.genesys.com/explore/course/genesys-cloud-cx-an-overview",
      "description": "Formerly known as Overview of Genesys Cloud CX, this course provides an overview to the Genesys Cloud CX interface and expands your understanding of the administration of a contact center.",
      "learning_type": "Elearning",
      "duration": "15 mins",
      "course_outline": [
        "Explain the basics of Genesys Cloud CX Contact Center Administration.",
        "Discuss the purpose of Genesys Cloud CX Architect in a contact center.",
        "Utilize Genesys Cloud CX supervisor tools.",
        "Explain the use of Scripting in a Genesys Cloud CX contact center.",
        "Outline the basic features of outbound dialing.",
        "Describe Quality Management in a Genesys Cloud CX contact center.",
        "Describe Workforce Management in a Genesys Cloud CX contact center.",
        "Overview of the Genesys Cloud CX PlatformOverview of the Genesys Cloud CX PlatformFeatures of Genesys Cloud CX CollaborateFeatures of Genesys Cloud CX Contact CenterGenesys Cloud CX Contact Center FeaturesArchitectSupervisor Tools – Reports and DashboardsScripts and Basic Script Functionality Outbound Quality Management Workforce Management"
      ],
      "page_length": 241737,
      "extraction_timestamp": "2025-09-24T18:50:45.779187"
    },
    {
      "title": "Introduction to Genesys Cloud for Agents: Working Together",
      "url": "https://beyond.genesys.com/explore/course/introduction-to-genesys-cloud-for-agents-working-together",
      "description": "Genesys Cloud is an easy and intuitive suite of cloud services for communication, collaboration, and customer experience management. This course shows you how using the directory and Agent Assistance help allow you to effectively interact and easily find assistance. It includes the following topics:",
      "learning_type": "Elearning",
      "duration": "20 mins",
      "course_outline": [
        "Using the Directory",
        "Agent Assistance",
        "Use the Directory and External Contact features in Genesys Cloud.",
        "Explain the Agent Assistance feature in Genesys Cloud.",
        "Create a group to interact with your team.",
        "Discuss the Workspace feature in Genesys. Cloud.",
        "Using the Directory"
      ],
      "page_length": 241686,
      "extraction_timestamp": "2025-09-24T18:51:01.605550"
    },
    {
      "title": "Introduction to Genesys Cloud for Agents: The Basics",
      "url": "https://beyond.genesys.com/explore/course/introduction-to-genesys-cloud-for-agents-the-basics",
      "description": "This course introduces you to Genesys Cloud. You will also learn the basics of Genesys Cloud such as logging in, setting up a phone, and navigating the interface. In addition, this course helps you to use presence and status features.",
      "learning_type": "Elearning",
      "duration": "20 mins",
      "course_outline": [
        "Log in and select a phone.",
        "Navigate Genesys Cloud.",
        "Use the multi-contextual panel for the Genesys Cloud agent workspace.",
        "Manage your presence and status.",
        "Use queues.",
        "Log out of Genesys Cloud at the end of your shift.",
        "The course introduces you to Genesys Cloud. You will also learn the basics of Genesys Cloud such as logging in, setting up a phone, and navigating the interface. In addition, this course helps you to use presence and status features. It includes the following topics:Log in and Set up Your PhoneNavigate Genesys CloudUse Multi-Contextual PanelManage Presence and StatusManage QueuesFinish the DayAdditional Features - Status",
        "Log in and Set up Your Phone"
      ],
      "page_length": 241675,
      "extraction_timestamp": "2025-09-24T18:51:17.701995"
    },
    {
      "title": "Genesys Cloud: Edge - Survivability",
      "url": "https://beyond.genesys.com/explore/course/genesys-cloud-edge-survivability",
      "description": "Genesys Cloud: Edge – Survivability eLearning provides an overview into the potential failures that might occur and how to prepare for them. As System Administrators, you will learn what disaster scenarios could result in a failure or outage and how to mitigate the impacts of a failure situation using preconfigured options. The course also presents testing considerations for your environment to ensure it is prepared in the event of an outage.",
      "learning_type": "Elearning",
      "duration": "15 mins",
      "course_outline": [
        "How Survivability Works",
        "Best Practices",
        "Survival Tests"
      ],
      "page_length": 241914,
      "extraction_timestamp": "2025-09-24T18:51:33.664787"
    },
    {
      "title": "Genesys Cloud CX: Development and Feedback - Usage for Agents",
      "url": "https://beyond.genesys.com/explore/course/genesys-cloud-cx-development-and-feedback-usage-for-agents",
      "description": "Genesys Cloud CX: Development and Feedback – Usage for Agents eLearning course provides an agent with the basic concepts on how to access and complete a development and feedback module.",
      "learning_type": "Elearning",
      "duration": "10 mins",
      "course_outline": [
        "View an assigned development and feedback module",
        "Complete an assigned module",
        "Viewing a Development and Feedback module",
        "Completing a Development and Feedback module"
      ],
      "page_length": 242295,
      "extraction_timestamp": "2025-09-24T18:51:50.862047"
    },
    {
      "title": "Genesys Cloud: WEM - Development and Feedback - Usage for Supervisors",
      "url": "https://beyond.genesys.com/explore/course/genesys-cloud-wem-development-and-feedback-usage-for-supervisors",
      "description": "This course provides an overview of development and feedback modules. You will learn how to create development and feedback modules, add content and questions, and assign the modules to agents. Furthermore, this course assists you in editing development and feedback modules that you have already created.",
      "learning_type": "Elearning",
      "duration": "25 mins",
      "course_outline": [
        "Describe the capabilities of development and feedback modules in Genesys Cloud.",
        "Create new development and feedback modules.",
        "Add SCORM-compliant packages to learning modules.",
        "Edit user-created development and feedback modules.",
        "Archive/unarchive development and feedback modules.",
        "Assign modules manually to specific agents based on requirements."
      ],
      "page_length": 242754,
      "extraction_timestamp": "2025-09-24T18:52:06.666451"
    },
    {
      "title": "Genesys Cloud CX: WEM - Time Off for Agents",
      "url": "https://beyond.genesys.com/explore/course/genesys-cloud-cx-wem-time-off-for-agents",
      "description": "Genesys Cloud CX: WEM -Time Off for Agents cover concepts to provide agents information on how to view and submit Time Off requests using Genesys Cloud Workforce Management.",
      "learning_type": "Elearning",
      "duration": "10 mins",
      "course_outline": [
        "Describe how agents can view and submit a time off request.",
        "Demonstrate how agents can see a summary of their time-off requests.",
        "Describe how time-off requests can be waitlisted when time-off limits are reached.",
        "Describe conditions where agents can edit a time-off request after it has been created.",
        "Describe time-off limits",
        "Demonstrate how to see time-off notifications in the inbox",
        "Navigate the My Time Off Dialog Box"
      ],
      "page_length": 242666,
      "extraction_timestamp": "2025-09-24T18:52:22.711760"
    },
    {
      "title": "Genesys Cloud CX: Performance Views for Agents",
      "url": "https://beyond.genesys.com/explore/course/genesys-cloud-cx-performance-views-for-agents",
      "description": "This course introduces you to the basic concepts of performance monitoring and management. As an agent, you will learn how to track your metrics, time in statuses, evaluations, interactions, schedules, real-time work performance, and learning modules. Additionally, this course equips you with the skills to customize your performance views and learn a few best practices on performance management.",
      "learning_type": "Elearning",
      "duration": "30 mins",
      "course_outline": [
        "Explain the purpose and functionality of different Performance views.",
        "Demonstrate how to customize and save views.",
        "Describe how to export, schedule, and manage view data efficiently.",
        "Outline the best practices for exporting view data.",
        "Explain the function of My Queues Activity view."
      ],
      "page_length": 242611,
      "extraction_timestamp": "2025-09-24T18:52:38.695495"
    },
    {
      "title": "Genesys Cloud: WEM - Quality Management - Reviewing My Evaluations",
      "url": "https://beyond.genesys.com/explore/course/genesys-cloud-wem-quality-management-reviewing-my-evaluations",
      "description": "Genesys Cloud: WEM - Quality Management - Reviewing My Evaluations course covers concepts to provide agents an overview about how to access, review, dispute, and complete their evaluations using Genesys Cloud.",
      "learning_type": "Elearning",
      "duration": "10 mins",
      "course_outline": [
        "Demonstrate how agents can view their evaluations data under Performance > Workspace > My Evaluations.",
        "Explain the various actions an agent can perform, such as saving the view, activating or deactivating a queue, exporting view data, scheduling an export, and customizing the columns.",
        "Demonstrate how agents can view evaluations from the Inbox.",
        "Describe how agents can open the interaction’s detail page to complete or review their evaluations.",
        "Demonstrate how agents can dispute their evaluations.",
        "My Evaluations View",
        "Review Your Evaluations"
      ],
      "page_length": 242778,
      "extraction_timestamp": "2025-09-24T18:52:54.506537"
    },
    {
      "title": "Genesys Cloud: WEM - Using Genesys Tempo Mobile Application",
      "url": "https://beyond.genesys.com/explore/course/genesys-cloud-wem-using-genesys-tempo-mobile-application",
      "description": "This course introduces you to the Genesys Tempo mobile application. You will learn how to view your workforce management schedules and manage your time off and shift trades using this app. In addition, this course equips you with the knowledge to provide feedback on the Genesys Tempo mobile application.",
      "learning_type": "Elearning",
      "duration": "15 mins",
      "course_outline": [
        "Log in and out of the Genesys Tempo mobile application.",
        "View potential shifts for unpublished schedules.",
        "View your workforce management schedules.",
        "Handle requests for time off and shift trades.",
        "Submit late notifications to your supervisors.",
        "Submit feedback about Genesys Tempo mobile application.",
        "Access Genesys Tempo"
      ],
      "page_length": 241712,
      "extraction_timestamp": "2025-09-24T18:53:10.373186"
    },
    {
      "title": "Genesys Cloud: API - User Management",
      "url": "https://beyond.genesys.com/explore/course/genesys-cloud-api-user-management",
      "description": "Genesys Cloud: API - User Management eLearning explains how to manage users using the User APIs. Using User APIs, administrators and developers can fetch user details, create and delete users, create and assign skills, and update passwords. The eLearning course also demonstrates how to change a user’s presence and routing status through User APIs.",
      "learning_type": "Elearning",
      "duration": "25 mins",
      "course_outline": [
        "Overview",
        "User Management - 1",
        "User Management - 2"
      ],
      "page_length": 241666,
      "extraction_timestamp": "2025-09-24T18:53:25.985906"
    },
    {
      "title": "Genesys Cloud: API - Conversation Management",
      "url": "https://beyond.genesys.com/explore/course/genesys-cloud-api-conversation-management",
      "description": "Genesys Cloud allows users to manage the participant in the conversation using the platform API. The term conversation refers to an interaction between multiple participants over a media channel, such as web messaging, phone, or email. Genesys Cloud: API - Conversation Management eLearning provides an overview to the concepts related to conversation management in Genesys Cloud. It also explains how to configure system alerts using platform API.",
      "learning_type": "Elearning",
      "duration": "20 mins",
      "course_outline": [
        "Overview",
        "Participation Management",
        "System Alerts"
      ],
      "page_length": 241773,
      "extraction_timestamp": "2025-09-24T18:53:41.075044"
    },
    {
      "title": "Genesys Cloud: Contact Center Administrator - Scripting",
      "url": "https://beyond.genesys.com/explore/course/genesys-cloud-contact-center-administrator-scripting",
      "description": "Genesys Cloud: Contact Center Administrator- Scripting eLearning is designed to explain what scripting is and how it can be utilized by a contact center administrator to improve the agents' effectiveness. The eLearning provided in this course will cover basic knowledge about how to build scripts and the different tools used inside of the script editor.",
      "learning_type": "Elearning",
      "duration": "35 mins",
      "course_outline": [
        "Genesys Cloud: Contact Center Administrator - Scripting eLearning: Introduction to Scripts Script Components Script Pages Script Properties Script Variables Actions Usage in Scripts Component Templates Usage in Scripts",
        "Introduction to Scripts",
        "Script Components",
        "Script Pages",
        "Script Properties",
        "Script Variables",
        "Actions Usage in Scripts",
        "Component Templates Usage in Scripts"
      ],
      "page_length": 241901,
      "extraction_timestamp": "2025-09-24T18:53:58.488562"
    },
    {
      "title": "Genesys Cloud: Contact Center Administrator - ACD",
      "url": "https://beyond.genesys.com/explore/course/genesys-cloud-contact-center-administrator-acd",
      "description": "Genesys Cloud: Contact Center Administrator- ACD e-learning is designed to provide knowledge necessary understand what Automatic Call Distribution (commonly known as ACD) means Genesys Cloud Contact Center. Depending on your needs, the processing can be simple- for example, just delivering the interaction to the next agent on the list – or more complex, like using bullseye routing along with agent utilization. The following e-learning covers introductory ACD, ACD Routing, and lastly ACD Utilization Option configurations within Genesys Cloud.",
      "learning_type": "Elearning",
      "duration": "15 mins",
      "course_outline": [
        "Genesys Cloud: Contact Center Administrator-ACD covers the following objectives: Introduction to Automatic Call Distribution (ACD) Automatic Call Distribution (ACD) Routing Automatic Call Distribution (ACD) Utilization Options",
        "Introduction to Automatic Call Distribution (ACD)",
        "Automatic Call Distribution (ACD) Routing",
        "Automatic Call Distribution (ACD) Utilization Options"
      ],
      "page_length": 242321,
      "extraction_timestamp": "2025-09-24T18:54:16.027870"
    },
    {
      "title": "Genesys Cloud: Contact Center Administrator - Initial Configuration",
      "url": "https://beyond.genesys.com/explore/course/genesys-cloud-contact-center-administrator-initial-configuration",
      "description": "Genesys Cloud: Contact Center Administrator- Initial Configuration e-learning is designed to provide knowledge necessary to administer Genesys Cloud Contact Center. Configuring Contact Center starts with observing the initial settings that make up the foundation Genesys Cloud Contact Center by walking through concepts such as: Wrap-Up Codes, Skills and Language Configuration, Queue Configuration and Management, and lastly Email Routing. Establishing this base knowledge is recommended to better understand how to administer Genesys Cloud.",
      "learning_type": "Elearning",
      "duration": "20 mins",
      "course_outline": [
        "Genesys Cloud: Contact Center Administrator- Initial Configuration covers the following objectives: Wrap-Up Codes Skill and Language Configuration Queue Configuration and Management Email Objectives",
        "Wrap-Up Codes",
        "Skill and Language Configuration",
        "Queue Configuration and Management",
        "Email Objectives"
      ],
      "page_length": 242362,
      "extraction_timestamp": "2025-09-24T18:54:40.780876"
    },
    {
      "title": "Genesys Cloud Performance Dashboards",
      "url": "https://beyond.genesys.com/explore/course/genesys-cloud-performance-dashboards",
      "description": "Genesys Cloud allows you to quickly create and share customizable performance dashboards with your team, no matter where you’re working from. With simple to use widgets and a variety of graphing and visual options, you can create custom dashboards of key metrics important to your contact center, such as handle time, wrap-up codes, bot flows, and more.",
      "learning_type": "Elearning",
      "duration": "25 mins",
      "course_outline": [],
      "page_length": 241244,
      "extraction_timestamp": "2025-09-24T18:55:00.436972"
    },
    {
      "title": "Introduction to Genesys Cloud for Supervisors: Additional Features",
      "url": "https://beyond.genesys.com/explore/course/introduction-to-genesys-cloud-for-supervisors-additional-features",
      "description": "This course introduces you to some of the advanced features and settings in Genesys Cloud that supervisors can perform. You’ll learn about outbound dialing and how to create, run, and manage outbound campaigns and scripts. In addition, you’ll learn how to monitor and evaluate agent interactions.",
      "learning_type": "Elearning",
      "duration": "15 mins",
      "course_outline": [
        "Create, run, and monitor outbound campaigns.",
        "Create and work with scripts.",
        "Monitor and assist live agent interactions.",
        "Assign and evaluate agent interactions.",
        "The following sections are available in the course:Outbound DialingScriptsMonitor, Coach and Barge InEvaluation",
        "Outbound Dialing",
        "Scripts",
        "Monitor, Coach and Barge In"
      ],
      "page_length": 241721,
      "extraction_timestamp": "2025-09-24T18:55:22.616523"
    },
    {
      "title": "Introduction to Genesys Cloud for Supervisors: Analytics and Reporting",
      "url": "https://beyond.genesys.com/explore/course/introduction-to-genesys-cloud-for-supervisors-analytics-and-reporting",
      "description": "This course introduces you to the analytics and reporting features of Genesys Cloud. You will also learn to access and view various dynamic views, dashboards, reports, and alerts. In addition, this course also explains how to create new dashboards, reports, and alerts.",
      "learning_type": "Elearning",
      "duration": "30 mins",
      "course_outline": [
        "Identify the analytics and reporting features of Genesys Cloud.",
        "Access dynamic views, dashboards, and alerts.",
        "Export historical reports.",
        "Create new dashboards and custom alerts.",
        "The following sections are available in this course:IntroductionDynamic ViewsExported ReportsDashboardsAlerts",
        "Introduction",
        "Dynamic Views",
        "Exported Reports"
      ],
      "page_length": 241465,
      "extraction_timestamp": "2025-09-24T18:55:40.469894"
    },
    {
      "title": "Genesys Cloud CX: AI - Predictive Engagement - Web Tracking for Developers",
      "url": "https://beyond.genesys.com/explore/course/genesys-cloud-cx-ai-predictive-engagement-web-tracking-for-developers",
      "description": "This course walks you through the step-by-step configuration of tracking and managing visitor activity by Genesys Predictive Engagement on a website. In addition, this course equips you with the knowledge of how developers use the Messenger JavaScript software development kit (SDK) to customize the web tracking settings.",
      "learning_type": "Elearning",
      "duration": "15 mins",
      "course_outline": [
        "Genesys Cloud: Web Messaging",
        "Genesys Cloud CX: AI - Predictive Engagement - Setup and Configuration",
        "Genesys Cloud CX: AI - Predictive Engagement - Working with Action Maps",
        "Explain the importance of web tracking.",
        "Configure web tracking settings.",
        "Customize web tracking settings.",
        "Overview"
      ],
      "page_length": 241948,
      "extraction_timestamp": "2025-09-24T18:56:09.232633"
    },
    {
      "title": "Genesys Cloud CX: AI - Predictive Engagement - Setup and Configuration",
      "url": "https://beyond.genesys.com/explore/course/genesys-cloud-cx-ai-predictive-engagement-setup-and-configuration",
      "description": "This course explains the setting up and configuration of Genesys Predictive Engagement to work with web messaging. In addition, this course equips you with the knowledge of the Genesys Predictive Engagement feature and how it works.",
      "learning_type": "Elearning",
      "duration": "30 mins",
      "course_outline": [
        "Genesys Cloud CX: Web Messaging",
        "Genesys Cloud CX: AI - Unified Experience with Bots, GPE, and GPR",
        "Fulfill the initial tasks required to start the configuration of the Genesys Predictive Engagement.",
        "Configure Genesys Messenger and deploy it to your website.",
        "Configure web tracking.",
        "Configure Genesys Predictive Engagement commands and events.",
        "Create segments.",
        "Create outcomes.",
        "Create action maps."
      ],
      "page_length": 242130,
      "extraction_timestamp": "2025-09-24T18:56:29.059468"
    },
    {
      "title": "Genesys Cloud CX: AI - Predictive Routing - Configuration",
      "url": "https://beyond.genesys.com/explore/course/genesys-cloud-cx-ai-predictive-routing-configuration",
      "description": "The Genesys Cloud CX: AI - Predictive Routing – Configuration course explains the steps to configure predictive routing in Genesys Cloud CX. Predictive routing uses AI to discover the best available match between an agent and specific interaction. Learn how to activate and monitor predictive routing in your organization.",
      "learning_type": "Elearning",
      "duration": "20 mins",
      "course_outline": [
        "Explains the steps involved in configuring predictive routing.",
        "Explains the routing methods and additional setting required for predictive routing.",
        "Explains the process of activating and monitoring predictive routing.",
        "Queue ConfigurationCreating a QueueRouting and EvaluationsAdditional ConfigurationTimeoutSkill MatchingActivate and Monitor Predictive RoutingActivate Predictive Routing on a QueueOngoing Value Monitoring",
        "Creating a Queue",
        "Routing and Evaluations",
        "Timeout",
        "Skill Matching"
      ],
      "page_length": 246692,
      "extraction_timestamp": "2025-09-24T18:56:49.017555"
    },
    {
      "title": "Genesys Cloud CX: WEM - Speech and Text Analytics - Topic Spotting",
      "url": "https://beyond.genesys.com/explore/course/genesys-cloud-cx-wem-speech-and-text-analytics-topic-spotting",
      "description": "Topic spotting is a set of speech and text analytics metrics that can improve the business outcome.",
      "learning_type": "Elearning",
      "duration": "20 mins",
      "course_outline": [
        "Describe topics, programs, and phrases.",
        "Explain the prerequisites of topics, programs, and phrases.",
        "Create, edit, and delete topics, programs, and phrases.",
        "Course Overview",
        "Topics, Programs, and Phrases Overview",
        "Topics",
        "Programs"
      ],
      "page_length": 246860,
      "extraction_timestamp": "2025-09-24T18:57:11.566810"
    },
    {
      "title": "Genesys Cloud CX: AI - Predictive Routing - Getting Started",
      "url": "https://beyond.genesys.com/explore/course/genesys-cloud-cx-ai-predictive-routing-getting-started",
      "description": "Genesys predictive routing (GPR) is an artificial intelligence (AI) based mechanism that matches and routes each interaction to the best available agent.",
      "learning_type": "Elearning",
      "duration": "20 mins",
      "course_outline": [
        "Explain the advantages of predictive routing over the other routing methods.",
        "Perform a benefit assessment evaluation to explore where it might benefit your organization.",
        "Perform the steps to start a routing methods comparison test and view its results.",
        "Explain the data considerations for queue optimization.",
        "Predictive Routing Overview",
        "Benefit Assessment",
        "Comparison Test"
      ],
      "page_length": 241614,
      "extraction_timestamp": "2025-09-24T18:57:38.792791"
    },
    {
      "title": "Genesys Cloud CX: AI/Bots - Knowledge Workbench",
      "url": "https://beyond.genesys.com/explore/course/genesys-cloud-cx-ai-bots-knowledge-workbench",
      "description": "",
      "learning_type": "",
      "duration": "",
      "course_outline": [],
      "page_length": 190063,
      "extraction_timestamp": "2025-09-24T18:57:56.039551"
    },
    {
      "title": "Genesys Cloud Contact Center Features",
      "url": "https://beyond.genesys.com/explore/course/genesys-cloud-contact-center-features",
      "description": "This course provides an introduction to Genesys Cloud features and expands your understanding of the administration of a contact center.",
      "learning_type": "Elearning",
      "duration": "5 mins",
      "course_outline": [
        "Discuss the purpose of Genesys Cloud Architect in a contact center.",
        "Utilize Genesys Cloud supervisor tools.",
        "Explain the use of Scripting in a Genesys Cloud contact center.",
        "Outline the basic features of outbound dialing.",
        "Describe Quality Management in a Genesys Cloud contact center.",
        "Describe Workforce Management in a Genesys Cloud contact center.",
        "Genesys Cloud Contact Center FeaturesArchitectSupervisor Tools – Dynamic Views and DashboardsScripts and Basic Script Functionality Outbound Quality Management Workforce Management",
        "Architect"
      ],
      "page_length": 241371,
      "extraction_timestamp": "2025-09-24T18:58:19.094728"
    },
    {
      "title": "Genesys Cloud Platform",
      "url": "https://beyond.genesys.com/explore/course/genesys-cloud-platform",
      "description": "This course provides an overview of the Genesys Cloud platform and provides an introduction to Genesys Cloud Collaborate, Genesys Cloud Communicate, and Genesys Cloud Contact Center.",
      "learning_type": "Elearning",
      "duration": "10 mins",
      "course_outline": [
        "Explain the basics of Genesys Cloud CX Contact Center Administration",
        "Overview of the Genesys Cloud PlatformFeatures of Genesys Cloud CollaborateFeatures of Genesys Cloud CommunicateFeatures of Genesys Cloud Contact Center",
        "Overview of the Genesys Cloud Platform",
        "Features of Genesys Cloud Collaborate",
        "Features of Genesys Cloud Communicate",
        "Features of Genesys Cloud Contact Center"
      ],
      "page_length": 240996,
      "extraction_timestamp": "2025-09-24T18:58:36.054417"
    },
    {
      "title": "Genesys Cloud: API - License",
      "url": "https://beyond.genesys.com/explore/course/genesys-cloud-api-license",
      "description": "This course introduces the Genesys Cloud License APIs and their practical applications. It also provides a refresher on Genesys Cloud licenses and explains how licensing impacts the allocation of free API calls for your organization. Additionally, you will gain insights into Genesys Cloud’s Fair Usage Policy, which allows most organizations to use APIs without additional charges. For those who exceed the free limit, we’ll explain how overage charges are applied and how to manage them efficiently.",
      "learning_type": "Elearning",
      "duration": "30 mins",
      "course_outline": [
        "Explore the core subscription plans and add-ons offered by Genesys Cloud.",
        "Understand the API fair usage policy and how it applies to your organization.",
        "Interpret how overage charges are calculated when API usage exceeds the fair usage policy.",
        "Manage Genesys Cloud Licenses using License APIs.",
        "Fair Usage Policy",
        "API Fair Usage Calculation",
        "Managing Licenses Through APIs"
      ],
      "page_length": 242305,
      "extraction_timestamp": "2025-09-24T18:58:57.693534"
    },
    {
      "title": "Genesys Cloud: WEM - Voice Surveys",
      "url": "https://beyond.genesys.com/explore/course/genesys-cloud-wem-voice-surveys",
      "description": "This course introduces you to voice surveys. You will learn to create and customize a voice survey flow from a survey form. In addition, you will learn the different features of the voice survey flow and how to attach it to an inbound callflow. The course will also showcase the best practices to follow and where to view the results of your voice surveys.",
      "learning_type": "Elearning",
      "duration": "20 mins",
      "course_outline": [
        "Understand the purpose of a voice survey in a contact center.",
        "Identify the factors to consider before creating a voice survey flow.",
        "Describe the end-to-end process of creating, deploying, and analyzing a voice survey.",
        "List the best practices to follow for a voice survey flow.",
        "Introduction to Voice Survey",
        "Voice Survey Lifecycle",
        "Voice Survey in Action"
      ],
      "page_length": 241801,
      "extraction_timestamp": "2025-09-24T18:59:20.712525"
    },
    {
      "title": "Genesys Cloud: Journey Management - Journey Analyzer - Building Charts",
      "url": "https://beyond.genesys.com/explore/course/genesys-cloud-journey-management-journey-analyzer-building-charts",
      "description": "This course introduces you to charts in Journey Management. You will learn how to build a variety of foundational charts to drill down and monitor journey trends and behavior patterns over time and between journey variables. In addition, the course also covers the ways in which you can troubleshoot chart result errors.",
      "learning_type": "Elearning",
      "duration": "25 mins",
      "course_outline": [
        "Explain charts and their types in Journey Management.",
        "Navigate the chart editor interface and understand the various options to create, edit, and manage charts.",
        "Build time series charts (line format) to measure customer behavior over time.",
        "Build event attribute charts (bar and column formats) to measure customer behavior by event attributes.",
        "Troubleshoot errors in chart results.",
        "Journey Management Charts",
        "Chart Data and Formats"
      ],
      "page_length": 242273,
      "extraction_timestamp": "2025-09-24T18:59:44.433557"
    },
    {
      "title": "Genesys Cloud: WEM - Supervisor Activity View",
      "url": "https://beyond.genesys.com/explore/course/genesys-cloud-wem-supervisor-activity-view",
      "description": "This course explains the details of the Supervisor Activity View screen. You will learn how this view helps you analyze the agent performance, schedule adherence, learning, and coaching compliance. In addition, this course will also explain how to use the features in the supervisor activity view screen to improve agent efficiency.",
      "learning_type": "Elearning",
      "duration": "30 mins",
      "course_outline": [
        "Genesys Cloud: Coaching – Overview",
        "Genesys Cloud: Coaching – Usage for Supervisors",
        "Genesys Cloud: Development and Feedback – Usage for Supervisors",
        "Genesys Cloud: WEM – Performance Management with Scoreboard Insights",
        "Genesys Cloud: WFM - Monitoring and Adherence",
        "Genesys Cloud: WFM - Scheduling",
        "Understand and differentiate agent activity view and supervisor activity view.",
        "Analyze and understand the data in the supervisor activity view widgets.",
        "Use the features in the widgets to help improve agents’ performance."
      ],
      "page_length": 242184,
      "extraction_timestamp": "2025-09-24T19:00:09.131130"
    },
    {
      "title": "Genesys Cloud CX: API - Speech and Text Analytics",
      "url": "https://beyond.genesys.com/explore/course/genesys-cloud-cx-api-speech-and-text-analytics",
      "description": "This course introduces you to Speech and Text Analytics and how to use Application Programming Interfaces (API) to fetch speech and text analytics data. During this course, you will also learn how to use the Interaction dashboard to perform sentiment analysis. In addition, this course describes the basics of customized reporting.",
      "learning_type": "Elearning",
      "duration": "60 mins",
      "course_outline": [
        "Use the Interaction dashboard to view the speech and text analytics data associated with an interaction.",
        "Use speech and text analytics APIs to Create customized reports.",
        "Speech and Text Analytics Overview",
        "Speech and Text Analytics API Endpoints"
      ],
      "page_length": 243248,
      "extraction_timestamp": "2025-09-24T19:00:26.398059"
    },
    {
      "title": "Genesys Cloud CX: AI/Bots - Fundamentals",
      "url": "https://beyond.genesys.com/explore/course/genesys-cloud-cx-ai-bots-fundamentals",
      "description": "",
      "learning_type": "",
      "duration": "",
      "course_outline": [],
      "page_length": 190063,
      "extraction_timestamp": "2025-09-24T19:00:47.303525"
    },
    {
      "title": "Genesys Cloud CX: AI/Bots - Intent Miner",
      "url": "https://beyond.genesys.com/explore/course/genesys-cloud-cx-ai-bots-intent-miner",
      "description": "",
      "learning_type": "",
      "duration": "",
      "course_outline": [],
      "page_length": 190063,
      "extraction_timestamp": "2025-09-24T19:01:07.396632"
    },
    {
      "title": "Genesys Cloud: WEM - Time-Off Management",
      "url": "https://beyond.genesys.com/explore/course/genesys-cloud-wem-time-off-management",
      "description": "This course explains the important time-off management features that are available in Genesys Cloud. Users with Administrator privileges can learn how to set time-off limits, create time-off plans, and configure auto-approval for time-off requests. Users with roles such as Agents, Supervisors, and Managers can learn how to manage time-off plans and time-off requests. In addition, this course will also help you learn how to synchronize time-off requests and request shift trades in Genesys Cloud.",
      "learning_type": "Elearning",
      "duration": "25 mins",
      "course_outline": [
        "Create and manage time-off limits.",
        "Create and manage time-off plans.",
        "Use staffing groups to allow time-off limits for a group of agents.",
        "Navigate and manage time-off requests.",
        "Synchronize time-off requests.",
        "Request and accept shift trades.",
        "Working with Time-off Limits"
      ],
      "page_length": 243763,
      "extraction_timestamp": "2025-09-24T19:01:30.843668"
    },
    {
      "title": "Genesys Cloud: Cloud Media Services - Business Continuity",
      "url": "https://beyond.genesys.com/explore/course/genesys-cloud-cloud-media-services-business-continuity",
      "description": "Genesys Cloud: Cloud Media Services – Business Continuity eLearning provides an overview into the best practices to survive business outages when using Genesys Cloud Voice. The course also highlights the various types of outages to consider when using Genesys Cloud.",
      "learning_type": "Elearning",
      "duration": "10 mins",
      "course_outline": [
        "Business Continuity"
      ],
      "page_length": 241501,
      "extraction_timestamp": "2025-09-24T19:01:49.483498"
    },
    {
      "title": "Genesys Cloud: Cloud Media Services - Purchase to Port",
      "url": "https://beyond.genesys.com/explore/course/genesys-cloud-cloud-media-services-purchase-to-port",
      "description": "Genesys Cloud: Cloud Media Services – Purchase to Port eLearning provides an overview of the process to acquire phone numbers for Genesys Cloud Voice. Phone number options include toll-free numbers and Direct Inward Dialing (DID) numbers. The course provides insight into managing the numbers acquired. Usage Report overview is also covered for exploration into tracked data of voice service consumption.",
      "learning_type": "Elearning",
      "duration": "35 mins",
      "course_outline": [
        "Location and site setup in Genesys Cloud Voice",
        "Purchasing phone number process overview",
        "Porting number process overview",
        "Managing porting requests and Genesys Cloud Voice numbers",
        "Emergency service support overview",
        "Usage report overview of voice service consumption data",
        "Locations and Site Setup"
      ],
      "page_length": 242007,
      "extraction_timestamp": "2025-09-24T19:02:10.466970"
    },
    {
      "title": "Genesys Cloud CX: Gamification",
      "url": "https://beyond.genesys.com/explore/course/genesys-cloud-cx-gamification",
      "description": "Gamification can help your organization achieve its objectives by defining goals, organizing profiles, and creating metrics to drive agent performance, increase productivity, and manage expectations.",
      "learning_type": "Elearning",
      "duration": "25 mins",
      "course_outline": [
        "Explain how Gamification can help in the call center.",
        "Create and configure profiles and metrics based on performance objectives.",
        "Activate and manage Gamification.",
        "Why Gamification",
        "Introduction to Agent Activity and Leaderboards",
        "Gamification Profiles",
        "Gamification Metrics"
      ],
      "page_length": 242346,
      "extraction_timestamp": "2025-09-24T19:02:31.849451"
    },
    {
      "title": "Genesys Cloud: Cloud Media Services - BYOC",
      "url": "https://beyond.genesys.com/explore/course/genesys-cloud-cloud-media-services-byoc",
      "description": "Genesys Cloud: Cloud Media Services – Telephony Connection Options eLearning provides an overview of the Bring Your Own Carrier (BYOC) telephony options that use third-party services with Genesys Cloud. In addition to learning about the available BYOC solutions, learners will also gain an understanding about troubleshooting concepts related to BYOC Cloud and Premise configurations.",
      "learning_type": "Elearning",
      "duration": "20 mins",
      "course_outline": [
        "BYOC Third-Party Options",
        "BYOC Troubleshooting"
      ],
      "page_length": 241831,
      "extraction_timestamp": "2025-09-24T19:02:48.375935"
    },
    {
      "title": "Genesys Cloud: WEM - Agent Activity View",
      "url": "https://beyond.genesys.com/explore/course/genesys-cloud-wem-agent-activity-view",
      "description": "This course introduces you to the basic concepts of the Agent Activity View screen—a tool that will help you manage your workday effectively. You will also learn how Agent Activity will gamify your workday and reward you with points based on your performance using a scorecard and leaderboard.",
      "learning_type": "Elearning",
      "duration": "15 mins",
      "course_outline": [
        "Understand Agent Activity View.",
        "Analyze and understand the data in the Agent Activity View widgets.",
        "Overview Tab",
        "Scorecard Tab",
        "Leaderboards Tab",
        "Schedule Tab",
        "Work Plan"
      ],
      "page_length": 242422,
      "extraction_timestamp": "2025-09-24T19:03:09.324033"
    },
    {
      "title": "Genesys Cloud CX: SMS Basics for Agents",
      "url": "https://beyond.genesys.com/explore/course/genesys-cloud-cx-sms-basics-for-agents",
      "description": "This microlearning course teaches agents how to receive and send SMS messages using Genesys Cloud CX.",
      "learning_type": "Elearning",
      "duration": "5 mins",
      "course_outline": [
        "Receive an SMS message",
        "Send an SMS message",
        "Receive an SMS message",
        "Send an SMS message"
      ],
      "page_length": 240778,
      "extraction_timestamp": "2025-09-24T19:03:29.184817"
    },
    {
      "title": "Genesys Cloud: AI/Bots - Knowledge Workbench - Knowledge Portal",
      "url": "https://beyond.genesys.com/explore/course/genesys-cloud-ai-bots-knowledge-workbench-knowledge-portal",
      "description": "",
      "learning_type": "",
      "duration": "",
      "course_outline": [],
      "page_length": 190063,
      "extraction_timestamp": "2025-09-24T19:03:52.747367"
    },
    {
      "title": "Genesys Cloud CX: AI/Bots - Knowledge Workbench - Knowledge Optimizer",
      "url": "https://beyond.genesys.com/explore/course/genesys-cloud-cx-ai-bots-knowledge-workbench-knowledge-optimizer",
      "description": "",
      "learning_type": "",
      "duration": "",
      "course_outline": [],
      "page_length": 190063,
      "extraction_timestamp": "2025-09-24T19:04:16.887030"
    },
    {
      "title": "Genesys Cloud CX: AI/Bots - Agent Assist",
      "url": "https://beyond.genesys.com/explore/course/genesys-cloud-cx-ai-bots-agent-assist",
      "description": "",
      "learning_type": "",
      "duration": "",
      "course_outline": [],
      "page_length": 190063,
      "extraction_timestamp": "2025-09-24T19:04:41.718413"
    },
    {
      "title": "Genesys Cloud CX: AI - Predictive Engagement - Integrations for Developers",
      "url": "https://beyond.genesys.com/explore/course/genesys-cloud-cx-ai-predictive-engagement-integrations-for-developers",
      "description": "This course explains the configuration of Genesys Predictive Engagement with third-party platforms. You will learn how to set up and pass on user information using data actions integration. In addition, the course describes how data actions integration, Architect workflow, and action maps work in tandem to provide information for the agents.",
      "learning_type": "Elearning",
      "duration": "20 mins",
      "course_outline": [
        "Genesys Cloud CX: Web Messaging",
        "Genesys Cloud CX: AI - Predictive Engagement - Setup and Configuration",
        "Genesys Cloud CX: AI - Predictive Engagement - Working with Action Maps",
        "Describe the importance of integrating Genesys Predictive Engagement and third-party applications.",
        "Install and configure data actions integration.",
        "Configure and publish an Architect workflow to associate leads.",
        "Configure an action map to use Architect flow action."
      ],
      "page_length": 242146,
      "extraction_timestamp": "2025-09-24T19:05:05.188497"
    },
    {
      "title": "Genesys Cloud CX: AI - Predictive Engagement - Reporting and Analytics",
      "url": "https://beyond.genesys.com/explore/course/genesys-cloud-cx-ai-predictive-engagement-reporting-and-analytics",
      "description": "Genesys Predictive Engagement (GPE) Reporting and Analytics uncovers correlations in the data gathered from your customer journeys.",
      "learning_type": "Elearning",
      "duration": "25 mins",
      "course_outline": [
        "Describe the data processing strategy adopted in the analytics process.",
        "Explain the high-level usage of performance reports.",
        "Analyze, customize, and execute performance reports.",
        "Monitor content offers.",
        "Analytics Overview",
        "Action Map Performance Report",
        "Segment Performance Report"
      ],
      "page_length": 241562,
      "extraction_timestamp": "2025-09-24T19:05:29.033334"
    },
    {
      "title": "Genesys Cloud: WEM - Speech and Text Analytics - Getting Started",
      "url": "https://beyond.genesys.com/explore/course/genesys-cloud-wem-speech-and-text-analytics-getting-started",
      "description": "Genesys Cloud: WEM - Speech and Text Analytics – Getting Started eLearning course introduces you to the basic concepts of Genesys Cloud CX Speech and Text Analytics. You will learn how to set up and configure Speech and Text Analytics in your organization. In addition, this course also briefs you about agent training using Speech and Text Analytics.",
      "learning_type": "Elearning",
      "duration": "15 mins",
      "course_outline": [
        "Describe Speech and Text Analytics.",
        "Set up and configure Speech and Text Analytics.",
        "Understand the use of Speech and Text Analytics.",
        "Speech and Text Analytics Overview Setup and Configuration Speech and Text Analytics in Action",
        "Speech and Text Analytics Overview",
        "Setup and Configuration",
        "Speech and Text Analytics in Action"
      ],
      "page_length": 243679,
      "extraction_timestamp": "2025-09-24T19:05:51.280956"
    },
    {
      "title": "Genesys Cloud CX: AI - Predictive Engagement - Customer Journey for Agents",
      "url": "https://beyond.genesys.com/explore/course/genesys-cloud-cx-ai-predictive-engagement-customer-journey-for-agents",
      "description": "This course introduces you to the customer journey and helps you learn how to access and utilize customer journey information on Genesys Cloud CX.",
      "learning_type": "Elearning",
      "duration": "25 mins",
      "course_outline": [
        "Explain customer journey.",
        "Access customer journey information.",
        "Utilize customer journey information to improve customer experience.",
        "The following topics are covered in this eLearning course:OverviewCustomer Journey ChannelsAccessing Customer JourneyCustomer Journey InformationCustomer Journey IconsInteraction Detail PageThe Customer Journey TabUse Cases",
        "Overview",
        "Customer Journey Channels",
        "Accessing Customer Journey",
        "Customer Journey Information"
      ],
      "page_length": 241263,
      "extraction_timestamp": "2025-09-24T19:06:16.629991"
    },
    {
      "title": "Genesys Cloud CX: AI - Predictive Engagement - Working with Action Maps",
      "url": "https://beyond.genesys.com/explore/course/genesys-cloud-cx-ai-predictive-engagement-working-with-action-maps",
      "description": "This course introduces you to the basic concepts of creating and implementing an action map. You will also learn how to trigger an action map, configure additional features, and the best practices to follow for action maps. In addition, you will also learn how to control an action map and the reasoning behind the triggering of action maps.",
      "learning_type": "Elearning",
      "duration": "35 mins",
      "course_outline": [
        "Explain action maps.",
        "Create, configure and offer action maps.",
        "Configure trigger for action maps.",
        "List the various available actions.",
        "Explain content offers.",
        "Configure additional features for action maps.",
        "Action Maps Overview"
      ],
      "page_length": 242055,
      "extraction_timestamp": "2025-09-24T19:06:37.758971"
    },
    {
      "title": "Contact Center Metrics for Agents",
      "url": "https://beyond.genesys.com/explore/course/contact-center-metrics-for-agents",
      "description": "This course introduces agents to contact center metrics, connecting their role to the goals and objectives of their organization.",
      "learning_type": "Elearning",
      "duration": "10 mins",
      "course_outline": [
        "The relationship between an organization's goals and objectives to the tracked metrics",
        "Basic metrics that measure agent productivity and performance",
        "The importance of metrics to an agent and the contact center",
        "Why Should You Care About Metrics?Metrics and YouHow Can Metrics Help Agents?",
        "Why Should You Care About Metrics?",
        "Metrics and You",
        "How Can Metrics Help Agents?"
      ],
      "page_length": 241308,
      "extraction_timestamp": "2025-09-24T19:06:54.120757"
    },
    {
      "title": "Genesys Cloud CX: AI/Bots - Agent Assist for Agents",
      "url": "https://beyond.genesys.com/explore/course/genesys-cloud-cx-ai-bots-agent-assist-for-agents",
      "description": "",
      "learning_type": "",
      "duration": "",
      "course_outline": [],
      "page_length": 190063,
      "extraction_timestamp": "2025-09-24T19:07:18.721966"
    },
    {
      "title": "Genesys Cloud CX: AI/Bots - Digital Bot Flow Actions and Tasks",
      "url": "https://beyond.genesys.com/explore/course/genesys-cloud-cx-ai-bots-digital-bot-flow-actions-and-tasks",
      "description": "",
      "learning_type": "",
      "duration": "",
      "course_outline": [],
      "page_length": 190063,
      "extraction_timestamp": "2025-09-24T19:07:40.750221"
    },
    {
      "title": "Genesys Cloud CX: Messaging for Agents",
      "url": "https://beyond.genesys.com/explore/course/genesys-cloud-cx-messaging-for-agents",
      "description": "This course covers the essential elements of message interactions in Genesys Cloud CX. Additionally, you will gain insights into the various messaging channels offered, including their functions, features, and considerations.",
      "learning_type": "Elearning",
      "duration": "10 mins",
      "course_outline": [
        "Outline the different types of messaging channels and their advantages",
        "Handle message interactions on Genesys Cloud CX",
        "Define the channel features and considerations",
        "Messaging Channel Types for Agents",
        "Messaging Interactions Panel",
        "Messaging Channel Considerations"
      ],
      "page_length": 241212,
      "extraction_timestamp": "2025-09-24T19:07:58.437961"
    },
    {
      "title": "Genesys Cloud CX: Digital - Onboarding Guide",
      "url": "https://beyond.genesys.com/explore/course/genesys-cloud-cx-digital-onboarding-guide",
      "description": "This guide will introduce you to the online resources and training that are available as you begin your journey into Genesys Cloud CX Digital.",
      "learning_type": "Elearning",
      "duration": "10 mins",
      "course_outline": [
        "Explore where to begin with implementing your Genesys Cloud CX Digital platform.",
        "Navigate relevant resources to get up to speed quickly.",
        "Understand the benefits of additional training through Beyond."
      ],
      "page_length": 240688,
      "extraction_timestamp": "2025-09-24T19:08:17.772241"
    },
    {
      "title": "Genesys Cloud CX: Asynchronous Messaging for Retail",
      "url": "https://beyond.genesys.com/explore/course/genesys-cloud-cx-asynchronous-messaging-for-retail",
      "description": "This eLearning course provides an overview of asynchronous messaging and how retail businesses can use this strategy to further their business goals.",
      "learning_type": "Elearning",
      "duration": "35 mins",
      "course_outline": [
        "Recognize the elements of an effective async strategy",
        "Examine and optimize your async strategy",
        "Assess effectiveness by monitoring your strategy's performance",
        "Find additional resources for async messaging",
        "The following are the sections covered in this eLearning module:Defining an Effective Async StrategyRefining Your Async Strategy Sustaining Success with Async",
        "Defining an Effective Async Strategy",
        "Refining Your Async Strategy",
        "Sustaining Success with Async"
      ],
      "page_length": 241160,
      "extraction_timestamp": "2025-09-24T19:08:40.241357"
    },
    {
      "title": "CX Cloud from Genesys and Salesforce - Initial Setup and Configuration",
      "url": "https://beyond.genesys.com/explore/course/cx-cloud-from-genesys-and-salesforce-initial-setup-and-configuration",
      "description": "This course introduces you to CX Cloud from Genesys and Salesforce and will be a comprehensive guide for the initial setup and configuration of the product. Regardless of your experience, this course will walk you through the installation process step-by-step, ensuring a smooth and hassle-free setup. In addition, this course includes a few tips, tricks, and callbacks to enhance your learning experience and help you complete the installation successfully.",
      "learning_type": "Elearning",
      "duration": "80 mins",
      "course_outline": [
        "Explain the basic features of CX Cloud from Genesys and Salesforce.",
        "List the prerequisites for the initial installation and configuration of the product.",
        "Install and configure the Core Services package.",
        "Install and configure the Service Cloud Voice package.",
        "Create and configure a contact center in Salesforce.",
        "Add users and assign permissions in Salesforce.",
        "Configure provisional admin settings."
      ],
      "page_length": 242489,
      "extraction_timestamp": "2025-09-24T19:09:02.031526"
    },
    {
      "title": "Genesys Cloud: WEM - Speech and Text Analytics - Improving Transcription Accuracy",
      "url": "https://beyond.genesys.com/explore/course/genesys-cloud-wem-speech-and-text-analytics-improving-transcription-accuracy",
      "description": "This course explains the factors that affect voice transcription accuracy in Speech and Text Analytics. You will also learn how to improve the accuracy of voice transcriptions with dictionary management and data donation. In addition, this course equips you with the knowledge to troubleshoot common issues.",
      "learning_type": "Elearning",
      "duration": "20 mins",
      "course_outline": [
        "List the factors affecting transcription accuracy and underlying issues of inaccurate transcriptions.",
        "Explain the features of dictionary management and how it enhances transcription accuracy.",
        "Explain the importance of adding phrases to topics to increase transcription accuracy.",
        "Understand how Extended Voice Transcription Services and data donation improve transcription accuracy.",
        "Understanding Transcription Accuracy",
        "Dictionary Management",
        "Adding Phrases to Topics"
      ],
      "page_length": 242339,
      "extraction_timestamp": "2025-09-24T19:09:22.458955"
    },
    {
      "title": "Genesys Cloud: AI - Agent Copilot - Agent Usage",
      "url": "https://beyond.genesys.com/explore/course/genesys-cloud-ai-agent-copilot-agent-usage",
      "description": "This course introduces you to Agent Copilot and how it leverages the power of artificial intelligence (AI) to help in customer service. You will learn about the different features of Agent Copilot and how each feature assists you during an interaction. In addition, you will also see the Copilot in action and learn how to improve the AI-powered suggestions for the forthcoming interactions.",
      "learning_type": "Elearning",
      "duration": "20 mins",
      "course_outline": [
        "Genesys Cloud: Voice Essentials for Agents",
        "Genesys Cloud: Email for Agents",
        "Genesys Cloud: Messaging for Agents",
        "Genesys Cloud: SMS Basics for Agents",
        "Describe the features and functions of Agent Copilot.",
        "Use Agent Copilot during customer interactions.",
        "Understand how to improve Agent Copilot.",
        "The course will cover the following topics:Overview of Agent CopilotAgent Copilot FeaturesAgent Copilot in Action"
      ],
      "page_length": 241919,
      "extraction_timestamp": "2025-09-24T19:09:42.967156"
    },
    {
      "title": "Genesys Cloud: AI - Agent Copilot - Setup and Configuration",
      "url": "https://beyond.genesys.com/explore/course/genesys-cloud-ai-agent-copilot-setup-and-configuration",
      "description": "This course introduces you to Genesys Agent Copilot and lays the foundation for its usage. In this course, you will learn about the permissions required to set up and configure Agent Copilot. In addition, this course equips you with the knowledge of creating Agent Copilot from square one.",
      "learning_type": "Elearning",
      "duration": "30 mins",
      "course_outline": [
        "Genesys Cloud CX: AI/Bots - Knowledge Workbench",
        "Genesys Cloud CX: AI/Bots - Knowledge Workbench - Knowledge Optimizer",
        "Explain what Agent Copilot is",
        "Describe the role of Agent Copilot in a contact center",
        "Identify the necessary permissions and roles to use Agent Copilot",
        "Create a new Agent Copilot",
        "Explain how Agent Copilot benefits the customer and the agent"
      ],
      "page_length": 241871,
      "extraction_timestamp": "2025-09-24T19:10:09.497810"
    },
    {
      "title": "Genesys Cloud: Journey Management - Getting Started Quickly",
      "url": "https://beyond.genesys.com/explore/course/genesys-cloud-journey-management-getting-started-quickly",
      "description": "This course introduces you to journey analysis samples for Journey Management. You will learn to access, configure, and use these sample analyses with your organization’s data in Journey Analyzer to discover key customer behavior insights within minutes.",
      "learning_type": "Elearning",
      "duration": "20 mins",
      "course_outline": [
        "Genesys Cloud: Journey Management for the Contact Center",
        "Genesys Cloud: Journey Management - Journey Analyzer",
        "Describe the journey analysis samples available on AppFoundry.",
        "Configure and import the journey analysis samples.",
        "Identify the options to customize and calculate the journey analysis samples with your organization’s data.",
        "Introduction",
        "Importing the Sample Journeys"
      ],
      "page_length": 241889,
      "extraction_timestamp": "2025-09-24T19:10:30.282539"
    },
    {
      "title": "Genesys Cloud: Journey Management - Journey Analyzer Filters and Connector Settings",
      "url": "https://beyond.genesys.com/explore/course/genesys-cloud-journey-management-journey-analyzer-filters-and-connector-settings",
      "description": "This course explains Genesys Cloud Journey Management’s capabilities in refining customer journey analysis. You will learn to utilize Journey Analyzer’s filters and connector settings to customize and refine events and connectors to reflect your unique needs and find the right customer insights.",
      "learning_type": "Elearning",
      "duration": "25 mins",
      "course_outline": [
        "Describe the importance of filters and connector settings in refining customer journey analysis.",
        "Apply event attribute filters on events in a customer journey.",
        "Configure a date range for the journey.",
        "Use connector settings to set time constraints and secondary actor joins.",
        "Importance of Filters and Connector Settings",
        "How are Event Level Filters Applied?",
        "Adding an Event Attribute Filter"
      ],
      "page_length": 242222,
      "extraction_timestamp": "2025-09-24T19:10:51.194140"
    },
    {
      "title": "Genesys Cloud: AI - Predictive Routing - Performance Reports",
      "url": "https://beyond.genesys.com/explore/course/genesys-cloud-ai-predictive-routing-performance-reports",
      "description": "This course provides an overview of Genesys Cloud AI Predictive Routing performance reports. You will learn how to evaluate the performance of Predictive Routing with the help of Predictive Routing queues views.",
      "learning_type": "Elearning",
      "duration": "25 mins",
      "course_outline": [
        "Recap the purpose of Genesys Cloud predictive routing.",
        "Explain the concept of queue performance with predictive routing.",
        "Assess predictive routing queue detail report.",
        "Analyze predictive routing queue impact report.",
        "Explore predictive model data."
      ],
      "page_length": 240962,
      "extraction_timestamp": "2025-09-24T19:11:12.631173"
    },
    {
      "title": "Genesys Cloud: WFM - Creating Forecasts",
      "url": "https://beyond.genesys.com/explore/course/genesys-cloud-wfm-creating-forecasts",
      "description": "This course provides a quick tutorial on how to create a short-term forecast.",
      "learning_type": "Elearning",
      "duration": "5 mins",
      "course_outline": [],
      "page_length": 241697,
      "extraction_timestamp": "2025-09-24T19:11:32.980897"
    },
    {
      "title": "Genesys Cloud: Journey Management - Journey Analyzer",
      "url": "https://beyond.genesys.com/explore/course/genesys-cloud-journey-management-journey-analyzer",
      "description": "This course provides a brief overview of customer journey management and introduces you to the Journey Analyzer feature. It also helps you learn how to use Journey Analyzer to measure and monitor customer behavior.",
      "learning_type": "Elearning",
      "duration": "25 mins",
      "course_outline": [
        "Discuss customer journey analytics.",
        "Explain Journey Management in Genesys Cloud.",
        "Outline the features of Journey Analyzer.",
        "Visualize simple customer journeys using Journey Analyzer.",
        "Customer Journey Analytics",
        "Genesys Cloud Journey Management",
        "Journey Analyzer Introduction"
      ],
      "page_length": 241767,
      "extraction_timestamp": "2025-09-24T19:11:53.871621"
    },
    {
      "title": "Genesys Cloud: Architect - Journey Flows",
      "url": "https://beyond.genesys.com/explore/course/genesys-cloud-architect-journey-flows",
      "description": "This course introduces you to the Journey Flows feature in Architect that can be useful in analyzing the customer’s self-service journey. You will also learn how flow milestones and flow outcomes are used to map the customer journey. In addition, you will also learn about the best practices and tips for using Journey Flows.",
      "learning_type": "Elearning",
      "duration": "15 mins",
      "course_outline": [
        "Visualize customer journeys using Journey Flows.",
        "Outline the benefits of Journey Flows.",
        "Explain the usage of flow milestones and flow outcomes.",
        "Recall the tips for using Journey Flows.",
        "Customer Journey Analytics",
        "Journey Flows",
        "Flow Outcomes and Flow Milestones"
      ],
      "page_length": 241855,
      "extraction_timestamp": "2025-09-24T19:12:18.453143"
    },
    {
      "title": "Genesys Cloud: WFM - Activity Codes and Work Plans",
      "url": "https://beyond.genesys.com/explore/course/genesys-cloud-wfm-activity-codes-and-work-plans",
      "description": "Make scheduling easier with properly built work plans in Workforce Management that account for business and legal requirements and your staff's needs. In this course, learn how to set up work plans for simpler scheduling, automate work plan rotations, configure your own activity codes.",
      "learning_type": "Elearning",
      "duration": "25 mins",
      "course_outline": [
        "Genesys Cloud: Introduction to Workforce Management Configuration",
        "Genesys Cloud: WFM - Business Unit and Management Unit ConfigurationGenesys Cloud: Workforce Management - Service Goal Templates and Planning Groups Configuration",
        "Genesys Cloud: Workforce Management - Service Goal Templates and Planning Groups Configuration",
        "Understand the intricacies of activity codes and work plans and how they work together for agent scheduling in Workforce Management.",
        "Create new activity codes.",
        "Configure work plans.",
        "Combine work plans into automated rotations.",
        "Describe the steps to assign work plans."
      ],
      "page_length": 242332,
      "extraction_timestamp": "2025-09-24T19:12:39.410520"
    },
    {
      "title": "Genesys Cloud: WEM - Speech and Text Analytics - Empathy Analysis",
      "url": "https://beyond.genesys.com/explore/course/genesys-cloud-wem-speech-and-text-analytics-empathy-analysis",
      "description": "Empathy analysis involves evaluating an agent's emotional intelligence and ability to empathize with customers during interactions.",
      "learning_type": "Elearning",
      "duration": "15 mins",
      "course_outline": [
        "Genesys Cloud CX: WEM - Speech and Text Analytics – Getting Started",
        "Genesys Cloud CX: WEM - Speech and Text Analytics – Voice and Digital Transcriptions",
        "Genesys Cloud CX: WEM - Speech and Text Analytics – Topic Spotting",
        "Genesys Cloud CX: WEM - Speech and Text Analytics – Sentiment Analysis",
        "Explain the purpose of the Empathy Analysis feature.",
        "Outline the benefits of utilizing empathy score.",
        "Apply the formula to calculate the empathy score.",
        "Show the steps to enable the Empathy Analysis feature."
      ],
      "page_length": 243279,
      "extraction_timestamp": "2025-09-24T19:13:04.628762"
    },
    {
      "title": "Genesys Cloud: WFM - Service Goal Templates and Planning Groups Configuration",
      "url": "https://beyond.genesys.com/explore/course/genesys-cloud-wfm-service-goal-templates-and-planning-groups-configuration",
      "description": "Learn how to create and configure planning groups in Workforce Management. This course will show you how to combine interaction route paths, such as queues, channels, languages, and skill sets, with service goal templates for your scheduling purposes.",
      "learning_type": "Elearning",
      "duration": "15 mins",
      "course_outline": [
        "Define the usage of service level goal templates and planning groups, and understand their relationship within Workforce Management.",
        "Configure a service level goal template.",
        "Build planning groups."
      ],
      "page_length": 242169,
      "extraction_timestamp": "2025-09-24T19:13:25.241902"
    },
    {
      "title": "Introduction to CX Cloud from Genesys and Salesforce - For Agents",
      "url": "https://beyond.genesys.com/explore/course/introduction-to-cx-cloud-from-genesys-and-salesforce-for-agents",
      "description": "This course introduces you to the fundamentals of CX Cloud from Genesys and Salesforce and lets you get familiar with the product. You will also learn how to perform essential functions of your day-to-day work. In addition, this course touches upon certain advanced features that agents can use.",
      "learning_type": "Elearning",
      "duration": "25 mins",
      "course_outline": [
        "Explain the features of the new CX Cloud from Genesys and Salesforce product.",
        "Describe the differences between the CTI integration and the new product.",
        "Demonstrate how to access CX Cloud in the Salesforce environment.",
        "Explain the role of the Omni-Channel widget in the CX Cloud interface.",
        "Explain the role of the Genesys Cloud CX Utility widget in the CX Cloud interface.",
        "Outline the use of AI and bots in CX Cloud.",
        "Introducing CX Cloud from Genesys and Salesforce"
      ],
      "page_length": 242181,
      "extraction_timestamp": "2025-09-24T19:13:49.270470"
    },
    {
      "title": "Genesys Cloud: SMS Messaging",
      "url": "https://beyond.genesys.com/explore/course/genesys-cloud-sms-messaging",
      "description": "The Genesys Cloud: SMS Messaging course explains the setup and configuration of SMS messaging in Genesys Cloud. You will also learn about long and short codes and details about purchasing and managing these codes. In addition, this course provides details about the other SMS features and regulations.",
      "learning_type": "Elearning",
      "duration": "30 mins",
      "course_outline": [
        "Architect ILT",
        "Genesys Cloud: Routing",
        "Genesys Cloud: Messaging Overview",
        "Genesys Cloud: Web Messaging",
        "Recall the purpose and basic capabilities of SMS messaging.",
        "Explain the purchasing process and management of SMS long and short codes.",
        "SMS OverviewSMS CodesMore on SMS"
      ],
      "page_length": 243715,
      "extraction_timestamp": "2025-09-24T19:14:06.933525"
    },
    {
      "title": "Genesys Cloud: Work Automation - Supervisor and Agent Usage",
      "url": "https://beyond.genesys.com/explore/course/genesys-cloud-work-automation-supervisor-and-agent-usage",
      "description": "This course introduces you to the Work Automation feature of Genesys Cloud and explains its primary components. In addition, this course helps supervisors and agents handle contact center operations effectively using Work Automation.",
      "learning_type": "Elearning",
      "duration": "35 mins",
      "course_outline": [
        "Explain the basics of Work Automation and its purpose.",
        "Use the supervisor/administrator Work item List view to filter and manage work items efficiently.",
        "Use agent flow and viewing tools to gain context over work items and complete tasks efficiently.",
        "Work Automation – An Overview",
        "Supervisor/Administrator List View",
        "Agent Flow and Viewing Tools"
      ],
      "page_length": 241440,
      "extraction_timestamp": "2025-09-24T19:14:28.353483"
    },
    {
      "title": "Genesys Cloud: Work Automation - Setup and Configuration",
      "url": "https://beyond.genesys.com/explore/course/genesys-cloud-work-automation-setup-and-configuration",
      "description": "Work Automation enables organizations to capture, assign, automate, and monitor units of work within contact centers and back offices.",
      "learning_type": "Elearning",
      "duration": "30 mins",
      "course_outline": [
        "Genesys Cloud CX: Contact Center Administration",
        "Genesys Cloud CX: Implementation",
        "Genesys Cloud CX: Reporting and Analytics",
        "Genesys Cloud CX: Architect",
        "Explain the basics of Work Automation.",
        "Manage the setup and configuration of workbins, custom attributes, worktypes, and their related features.",
        "Work Automation: An Introduction"
      ],
      "page_length": 241479,
      "extraction_timestamp": "2025-09-24T19:14:51.569511"
    },
    {
      "title": "Genesys Cloud: WFM - Business Unit and Management Unit Configuration",
      "url": "https://beyond.genesys.com/explore/course/genesys-cloud-wfm-business-unit-and-management-unit-configuration",
      "description": "Workforce Management (WFM) begins with planning and configuring your business and management units. In this course, we examine the relationship between these units and how to add them to your environment.",
      "learning_type": "Elearning",
      "duration": "30 mins",
      "course_outline": [
        "Understand how to organize your business in WFM efficiently.",
        "Workforce Management.",
        "Describe the relationship between business units and management units.",
        "Configure business units, including forecasts, scheduling, alternative shifts, and notifications.",
        "Set up management units, including scheduling, adherence, time-off, and shift-trading constraints."
      ],
      "page_length": 241062,
      "extraction_timestamp": "2025-09-24T19:15:13.335086"
    },
    {
      "title": "Genesys Cloud: Quality Management - Evaluating Interactions",
      "url": "https://beyond.genesys.com/explore/course/genesys-cloud-quality-management-evaluating-interactions",
      "description": "This course introduces you to the quality evaluation process within Genesys Cloud. As a Quality Evaluator, you'll learn how to assess interactions, manage evaluation assignments, resolve disputes, and complete the calibration process. You'll also explore how to navigate Quality Management activity data to monitor evaluation tasks, ensuring consistency, fairness, and alignment with organizational standards.",
      "learning_type": "Elearning",
      "duration": "30 mins",
      "course_outline": [
        "Evaluate an interaction to assess agent performance.",
        "Access Quality Management activity data as Quality Evaluators.",
        "Assign evaluations to the appropriate assignees based on availability, expertise, and workflow requirements.",
        "Manage evaluation disputes by revising, reassigning, or validating evaluation scores.",
        "Complete the calibration process to ensure consistent and unbiased scoring.",
        "Why Evaluate an Interaction?Accessing Quality Management Activity Data for EvaluatorsAssigning an Evaluation to an AssigneeManaging Evaluation DisputesPerforming a Calibration",
        "Why Evaluate an Interaction?",
        "Accessing Quality Management Activity Data for Evaluators"
      ],
      "page_length": 242975,
      "extraction_timestamp": "2025-09-24T19:15:36.298214"
    },
    {
      "title": "Genesys Cloud: Quality Management Configuration",
      "url": "https://beyond.genesys.com/explore/course/genesys-cloud-quality-management-configuration",
      "description": "This course introduces you to the Quality Administrator role in the Quality Management process. You will learn how to assign roles and permissions, enable call recording, create and manage evaluation forms and policies, and manage agents to support quality assurance processes. In addition, the course equips you with the knowledge to access quality management activity data pages relevant for quality administrators—ensuring you're prepared to drive performance, consistency, and compliance across your contact center.",
      "learning_type": "Elearning",
      "duration": "45 mins",
      "course_outline": [
        "Assign quality management roles and permissions to users to perform quality monitoring and evaluation tasks.",
        "Enable call recording at the trunk level to support quality and compliance requirements.",
        "Create evaluation forms to measure and improve agent performance.",
        "Create policies to streamline evaluations, calibrations, and interactions.",
        "Activate and deactivate agents to manage their availability and distribution.",
        "Access quality management activity data relevant to quality administrators in Genesys Cloud.",
        "Assigning Roles and PermissionsEnabling RecordingCreating an Evaluation FormAssigning an Evaluation to another AssigneeUnderstanding Policy ConceptsActivating and Deactivating AgentsAccessing Quality Management Activity Data for Administrators",
        "Assigning Roles and Permissions"
      ],
      "page_length": 243592,
      "extraction_timestamp": "2025-09-24T19:15:56.262927"
    },
    {
      "title": "Genesys Cloud CX: WEM - Speech and Text Analytics - Business Analytics for Speech Data",
      "url": "https://beyond.genesys.com/explore/course/genesys-cloud-cx-wem-speech-and-text-analytics-business-analytics-for-speech-data",
      "description": "This course helps you analyze Topic data and interactions to fine-tune your business processes. You will learn to use Topic Trends, Flow, Queue, and Agent topics views. In addition, this course will aid you in effectively using Content Search and Interaction Details to obtain the required data from the interactions.",
      "learning_type": "Elearning",
      "duration": "45 mins",
      "course_outline": [
        "Genesys Cloud CX: WEM - Speech and Text Analytics – Getting Started (Required)",
        "Genesys Cloud CX: WEM - Speech and Text Analytics – Sentiment Analysis (Required)",
        "Genesys Cloud CX: WEM - Speech and Text Analytics – Topic Spotting (Required)",
        "Genesys Cloud CX: WEM - Speech and Text Analytics – Voice and Digital Transcriptions (Required)",
        "Genesys Cloud CX: WEM - Speech and Text Analytics - Topic Miner (Required)",
        "Explain when and how to use the Topic Trends views.",
        "Create Flow topics, Queue topics, and Agent topics views.",
        "Demonstrate how to use Content Search.",
        "Describe how to use the interactions detail page."
      ],
      "page_length": 243996,
      "extraction_timestamp": "2025-09-24T19:16:14.520204"
    },
    {
      "title": "Genesys Cloud: Quality Management - Basics",
      "url": "https://beyond.genesys.com/explore/course/genesys-cloud-quality-management-basics",
      "description": "This course covers the basic concepts of Quality Management, including but not limited to processes, roles, and key components. You will also learn how to navigate the various views in Genesys Cloud that provide access to Quality Management activity data.",
      "learning_type": "Elearning",
      "duration": "10 mins",
      "course_outline": [
        "Quality Management Process SummaryQuality Management RolesKey Components of Quality ManagementEvaluation FormsEvaluation AssistanceQuality PoliciesCalibration ProcessEncryption KeysEvaluate an InteractionDispute an EvaluationAbility to Assign an Evaluation to Another AssigneeQuality Management DashboardAccessing Quality Management Data",
        "Quality Management Process Summary",
        "Quality Management Roles",
        "Key Components of Quality Management",
        "Accessing Quality Management Data"
      ],
      "page_length": 242506,
      "extraction_timestamp": "2025-09-24T19:16:37.155955"
    },
    {
      "title": "Genesys Cloud CX: WEM - Speech and Text Analytics - Topic Miner",
      "url": "https://beyond.genesys.com/explore/course/genesys-cloud-cx-wem-speech-and-text-analytics-topic-miner",
      "description": "Topic Miner identifies topics and associated phrases within contact center conversations, which can then be stored for analyzing customer sentiment and tracking topic trends. This feature facilitates the collection of useful insights for an organization to pinpoint areas of improvement, frame enhancement strategies, and deliver improved service.",
      "learning_type": "Elearning",
      "duration": "25 mins",
      "course_outline": [
        "Genesys Cloud CX: WEM - Speech and Text Analytics – Getting Started (Recommended)",
        "Genesys Cloud CX: WEM - Speech and Text Analytics – Sentiment Analysis (Recommended)",
        "Genesys Cloud CX: WEM - Speech and Text Analytics – Topic Spotting (Required)",
        "Genesys Cloud CX: WEM - Speech and Text Analytics – Voice and Digital Transcriptions (Recommended)",
        "Explain the benefits of utilizing Topic Miner.",
        "Create a new topic miner session.",
        "Create a new topic.",
        "Manage the mined phrases effectively.",
        "Delete a topic miner session."
      ],
      "page_length": 243681,
      "extraction_timestamp": "2025-09-24T19:17:01.852999"
    },
    {
      "title": "Genesys Cloud CX: AI/Bots - Build a Digital Bot for Inbound Message Flows",
      "url": "https://beyond.genesys.com/explore/course/genesys-cloud-cx-ai-bots-build-a-digital-bot-for-inbound-message-flows",
      "description": "",
      "learning_type": "",
      "duration": "",
      "course_outline": [],
      "page_length": 190063,
      "extraction_timestamp": "2025-09-24T19:17:34.898997"
    },
    {
      "title": "Contact Center Basics for Agents",
      "url": "https://beyond.genesys.com/explore/course/contact-center-basics-for-agents",
      "description": "This course introduces Agents to common contact center technologies, and how they can improve experiences for customers and employees.",
      "learning_type": "Elearning",
      "duration": "5 mins",
      "course_outline": [
        "How contact center technology can be used to create a positive experience.",
        "Basic contact center technology and how it adds value.",
        "Interaction-based TechnologiesWorkforce Engagement Management Technologies",
        "Interaction-based Technologies",
        "Workforce Engagement Management Technologies"
      ],
      "page_length": 240863,
      "extraction_timestamp": "2025-09-24T19:17:55.224777"
    },
    {
      "title": "The Agent's Role in the Contact Center",
      "url": "https://beyond.genesys.com/explore/course/the-agents-role-in-the-contact-center",
      "description": "This course examines the critical role of an agent in the contact center, providing positive customer experiences with empathy.",
      "learning_type": "Elearning",
      "duration": "5 mins",
      "course_outline": [
        "How agents make a difference",
        "Which traits you can use to be a successful agent",
        "How metrics can help you to measure your success",
        "How Agents Make a DifferenceTraits of Successful AgentsMeasuring Your Success",
        "How Agents Make a Difference",
        "Traits of Successful Agents",
        "Measuring Your Success"
      ],
      "page_length": 241131,
      "extraction_timestamp": "2025-09-24T19:18:20.474905"
    },
    {
      "title": "Empathy Basics for Agents",
      "url": "https://beyond.genesys.com/explore/course/empathy-basics-for-agents",
      "description": "This course looks at the impact of empathy displayed by contact center agents, and how to put it into action for better customer experiences.",
      "learning_type": "Elearning",
      "duration": "10 mins",
      "course_outline": [
        "Contact Center Basics for Agents",
        "The Agent's Role in the Contact Center",
        "Describe the differences between empathy and sympathy",
        "Identify strategies for demonstrating empathy",
        "Identify positive and negative customer experiences",
        "Empathy vs. SympathyEmpathy StrategiesIdentifying Empathy in Action",
        "Empathy vs. Sympathy",
        "Empathy Strategies"
      ],
      "page_length": 241173,
      "extraction_timestamp": "2025-09-24T19:18:46.064122"
    },
    {
      "title": "Genesys Cloud: WEM - Performance Management with Scorecard Insights",
      "url": "https://beyond.genesys.com/explore/course/genesys-cloud-wem-performance-management-with-scorecard-insights",
      "description": "Insights efficiently highlights the performance management needs of agents. It enables sorting by tracked KPIs in Gamification and allows scheduling, coaching, and learning follow-ups quickly with the agents.",
      "learning_type": "Elearning",
      "duration": "15 mins",
      "course_outline": [
        "Introduction to Insights",
        "Scorecard Insights"
      ],
      "page_length": 241485,
      "extraction_timestamp": "2025-09-24T19:19:03.389029"
    },
    {
      "title": "Genesys Cloud: AI/Bots - Use Knowledge Workbench with Bots",
      "url": "https://beyond.genesys.com/explore/course/genesys-cloud-ai-bots-use-knowledge-workbench-with-bots",
      "description": "",
      "learning_type": "",
      "duration": "",
      "course_outline": [],
      "page_length": 190063,
      "extraction_timestamp": "2025-09-24T19:19:23.250455"
    },
    {
      "title": "CX Cloud from Genesys and Salesforce: Beginner Guide for Agents",
      "url": "https://beyond.genesys.com/explore/course/cx-cloud-from-genesys-and-salesforce-beginner-guide-for-agents",
      "description": "This course introduces CX Cloud from Genesys and Salesforce to the agents and provides a tour of the interface. This course will also act as a reference guide to agents in order to perform their day-to-day contact center activities.",
      "learning_type": "Elearning",
      "duration": "15 mins",
      "course_outline": [
        "Explain the Genesys Cloud CX utility and Omni-Channel Widget",
        "Explain how to handle voice interactions",
        "Explain how to handle inbound web message interactions",
        "Genesys Cloud CX Utility/Omni-Channel Widget",
        "Voice Interactions",
        "Inbound Web Message"
      ],
      "page_length": 241298,
      "extraction_timestamp": "2025-09-24T19:19:43.814184"
    },
    {
      "title": "Genesys Cloud: Introduction to Workforce Management Configuration",
      "url": "https://beyond.genesys.com/explore/course/genesys-cloud-introduction-to-workforce-management-configuration",
      "description": "Explore employee engagement and flexibility while automating your staffing process through Genesys Cloud Workforce Management. This course introduces you to the benefits of Workforce Management and its many configuration options.",
      "learning_type": "Elearning",
      "duration": "10 mins",
      "course_outline": [],
      "page_length": 240660,
      "extraction_timestamp": "2025-09-24T19:20:03.165730"
    },
    {
      "title": "Genesys Cloud: Messaging Overview",
      "url": "https://beyond.genesys.com/explore/course/genesys-cloud-messaging-overview",
      "description": "This course covers the concepts of Genesys Cloud Messaging. You will learn about message routing, flows, and messaging threading timeline. Additionally, you will gain insights into the various messaging channels offered and learn how to work with message interactions.",
      "learning_type": "Elearning",
      "duration": "25 mins",
      "course_outline": [
        "Genesys Cloud CX – Architect",
        "Genesys Cloud CX – Routing",
        "Describe Genesys Cloud message routing.",
        "Explain asynchronous messages and messaging threading timelines.",
        "List messaging channel types.",
        "Message Routing",
        "Asynchronous Messaging"
      ],
      "page_length": 241544,
      "extraction_timestamp": "2025-09-24T19:20:22.413957"
    },
    {
      "title": "Genesys Cloud: AI/Bots - Bot Insights and Optimizations",
      "url": "https://beyond.genesys.com/explore/course/genesys-cloud-ai-bots-bot-insights-and-optimizations",
      "description": "",
      "learning_type": "",
      "duration": "",
      "course_outline": [],
      "page_length": 190063,
      "extraction_timestamp": "2025-09-24T19:20:42.345197"
    },
    {
      "title": "Genesys Cloud Work Automation - Business Value Overview",
      "url": "https://beyond.genesys.com/explore/course/genesys-cloud-work-automation-business-value-overview",
      "description": "Genesys Cloud Work Automation enables you to handle every customer request by integrating siloed applications in your organization from multiple back-end systems. It combines the power of workflow automation and agent routing to provide consistent end-to-end experiences.",
      "learning_type": "Elearning",
      "duration": "10 mins",
      "course_outline": [
        "Genesys Cloud CX: Contact Center Administration",
        "Genesys Cloud CX: Implementation",
        "Genesys Cloud CX: Reporting and Analytics",
        "Genesys Cloud CX: Architect",
        "Explain the benefits of Work Automation",
        "Identify the key components of Work Automation",
        "Work Automation - A Comprehensive Look"
      ],
      "page_length": 242165,
      "extraction_timestamp": "2025-09-24T19:21:09.267076"
    },
    {
      "title": "Genesys Cloud: WFM - Monitoring and Adherence",
      "url": "https://beyond.genesys.com/explore/course/genesys-cloud-wfm-monitoring-and-adherence",
      "description": "This course introduces you to the Genesys Cloud Workforce Management (WFM) performance views. You will learn to navigate and utilize the different performance views to monitor your agents’ performance and schedule adherence.",
      "learning_type": "Elearning",
      "duration": "25 mins",
      "course_outline": [
        "Explain the purpose of the various WFM performance views.",
        "Monitor your workforce’s current day performance and real-time schedule adherence using Intraday Monitoring and Real-Time Adherence views.",
        "Investigate your workforce’s historical performance, schedule adherence, and activity data using Historical Adherence and Historical Shrinkage views."
      ],
      "page_length": 242265,
      "extraction_timestamp": "2025-09-24T19:21:27.763680"
    },
    {
      "title": "Genesys Cloud: Journey Management for Contact Center Optimization",
      "url": "https://beyond.genesys.com/explore/course/genesys-cloud-journey-management-for-contact-center-optimization",
      "description": "This course introduces you to Genesys Cloud Journey Management (GCJM). You will learn about how Journey Flows (in Architect) and Journey Analyzer enable organizations to visualize customer behavior to measure, monitor, and manage end-to-end customer journeys.",
      "learning_type": "Elearning",
      "duration": "20 mins",
      "course_outline": [
        "Articulate the definition of journey management as a practice.",
        "Explain Journey Flows and Journey Analyzer features.",
        "Articulate how these features work together to optimize experiences and drive outcomes.",
        "Discuss how to use Journey Management features to orchestrate customer experiences.",
        "Journey Management Basics",
        "Journey Management Features",
        "Experience Orchestration"
      ],
      "page_length": 241775,
      "extraction_timestamp": "2025-09-24T19:21:47.372536"
    },
    {
      "title": "Genesys Cloud: WFM - Creating Schedules",
      "url": "https://beyond.genesys.com/explore/course/genesys-cloud-wfm-creating-schedules",
      "description": "This course will help you understand scheduling with Genesys Cloud Workforce Management (WFM), including ways to create and maintain schedules.",
      "learning_type": "Elearning",
      "duration": "25 mins",
      "course_outline": [
        "Understand the benefits of scheduling with WFM.",
        "Generate schedules with forecasting, as well as create blank schedules.",
        "Edit and maintain schedules."
      ],
      "page_length": 242106,
      "extraction_timestamp": "2025-09-24T19:22:07.542371"
    },
    {
      "title": "Genesys Cloud: AI - Agent Assist - Analytics and Best Practices",
      "url": "https://beyond.genesys.com/explore/course/genesys-cloud-ai-agent-assist-analytics-and-best-practices",
      "description": "This course recaps the basic concepts of Genesys Agent Assist and the use of the Agent Assist Performance dashboard. You will learn to analyze the dashboard and use data to enhance customer experience. In addition, this course lists the best practices for using Genesys Agent Assist.",
      "learning_type": "Elearning",
      "duration": "25 mins",
      "course_outline": [
        "Recap the features of Genesys Agent Assist.",
        "Understand how to utilize the Agent Assist Performance dashboard.",
        "List the best practices to use Genesys Agent Assist.",
        "Recap – Genesys Agent AssistAnalyticsBest Practices",
        "Recap – Genesys Agent Assist",
        "Analytics",
        "Best Practices"
      ],
      "page_length": 241632,
      "extraction_timestamp": "2025-09-24T19:22:27.543434"
    },
    {
      "title": "Genesys Cloud: Architect - Flow Outcomes and Flow Milestones",
      "url": "https://beyond.genesys.com/explore/course/genesys-cloud-architect-flow-outcomes-and-flow-milestones",
      "description": "This course introduces you to flow outcomes and flow milestones in Architect. You will learn how to configure these features, as well as leverage them to visualize customer interactions within Architect flows. In addition, you will learn about dashboards used to track flow outcomes and flow milestones.",
      "learning_type": "Elearning",
      "duration": "15 mins",
      "course_outline": [
        "Explain the concepts of flow outcomes and flow milestones.",
        "Configure flow outcomes and flow milestones.",
        "Discuss various methods for tracking flow outcomes and flow milestones.",
        "Flow Outcomes and Milestones",
        "Scenario to Configure Flow Outcomes and Flow Milestones",
        "Creating a Flow Outcome and Flow Milestones",
        "Adding a Milestone and Flow Outcomes"
      ],
      "page_length": 241856,
      "extraction_timestamp": "2025-09-24T19:22:47.005199"
    }
  ],
  "last_updated": "2025-09-24T22:24:13.657439",
  "fields_removed": [
    "target_audience",
    "level",
    "prerequisites",
    "course_objectives"
  ]
}